{"datetime_retrieved":"1747502005","date_of_thread":"2024-10-02","urs_data":{"scrape_settings":{"n_results":"all","style":"structured","url":"https://reddit.com/r/ethfinance/comments/1fu8i74/"},"data":{"submission_metadata":{"author":"u/ethfinance","created_utc":"2024-10-01 22:00:17","distinguished":"moderator","edited":false,"is_original_content":false,"is_self":true,"link_flair_text":"Discussion","locked":false,"nsfw":false,"num_comments":224,"permalink":"/r/ethfinance/comments/1fu8i74/daily_general_discussion_october_2_2024/","score":129,"selftext":"[removed]","spoiler":false,"stickied":false,"subreddit":"ethfinance","title":"Daily General Discussion - October 2, 2024","upvote_ratio":0.99},"comments":[{"author":"u/Tricky_Troll","body":"**Tricky's Daily Doots #894**\n\n**Yesterday's Daily 01/10/2024**\n\n[Previous Daily Doots](https://old.reddit.com/r/ethfinance/comments/1ftg8jb/daily_general_discussion_october_1_2024/lpsot3y/)\n\n- u/JebediahKholin has [had enough of the ETH value accrual FUD.](https://old.reddit.com/r/ethfinance/comments/1ftg8jb/daily_general_discussion_october_1_2024/lptqaln/) 😤\n\n- u/Dreth fills us in on [the happenings in Chinese financial markets.](https://old.reddit.com/r/ethfinance/comments/1ftg8jb/daily_general_discussion_october_1_2024/lpuikxy/) 🇨🇳\n\n- u/696_eth has the [EVMavericks weekly recap.](https://old.reddit.com/r/ethfinance/comments/1ftg8jb/daily_general_discussion_october_1_2024/lprs6hu/) 🦁\n\n- u/benido2030 explains [the utility of the EIGEN token.](https://old.reddit.com/r/ethfinance/comments/1ftg8jb/daily_general_discussion_october_1_2024/lpthpzq/) 🧠\n\n- u/Jey_s_TeArS brings us [the daily haiku.](https://old.reddit.com/r/ethfinance/comments/1ftg8jb/daily_general_discussion_october_1_2024/lpv7x80/) 📝","body_html":"<div class=\"md\"><p><strong>Tricky&#39;s Daily Doots #894</strong></p>\n\n<p><strong>Yesterday&#39;s Daily 01/10/2024</strong></p>\n\n<p><a href=\"https://old.reddit.com/r/ethfinance/comments/1ftg8jb/daily_general_discussion_october_1_2024/lpsot3y/\">Previous Daily Doots</a></p>\n\n<ul>\n<li><p><a href=\"/u/JebediahKholin\">u/JebediahKholin</a> has <a href=\"https://old.reddit.com/r/ethfinance/comments/1ftg8jb/daily_general_discussion_october_1_2024/lptqaln/\">had enough of the ETH value accrual FUD.</a> 😤</p></li>\n<li><p><a href=\"/u/Dreth\">u/Dreth</a> fills us in on <a href=\"https://old.reddit.com/r/ethfinance/comments/1ftg8jb/daily_general_discussion_october_1_2024/lpuikxy/\">the happenings in Chinese financial markets.</a> 🇨🇳</p></li>\n<li><p><a href=\"/u/696_eth\">u/696_eth</a> has the <a href=\"https://old.reddit.com/r/ethfinance/comments/1ftg8jb/daily_general_discussion_october_1_2024/lprs6hu/\">EVMavericks weekly recap.</a> 🦁</p></li>\n<li><p><a href=\"/u/benido2030\">u/benido2030</a> explains <a href=\"https://old.reddit.com/r/ethfinance/comments/1ftg8jb/daily_general_discussion_october_1_2024/lpthpzq/\">the utility of the EIGEN token.</a> 🧠</p></li>\n<li><p><a href=\"/u/Jey_s_TeArS\">u/Jey_s_TeArS</a> brings us <a href=\"https://old.reddit.com/r/ethfinance/comments/1ftg8jb/daily_general_discussion_october_1_2024/lpv7x80/\">the daily haiku.</a> 📝</p></li>\n</ul>\n</div>","created_utc":"2024-10-02 03:40:27","distinguished":"moderator","edited":false,"id":"lpyf6op","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":1,"stickied":true,"replies":[]},{"author":"u/austonst","body":"*Also posted in r/ethstaker, but I don't think people will mind seeing it here too:*\n\nI'd like to share an article I've written about what u/KuDeTa and I are doing with respect to block proposal timing games for the Aestus relay. We've been experimenting with timing games for a while and in the interest of transparency would like to share our motivation, proposer-configurable parameters, and a bit of data.\n\nThe full article is here: https://hackmd.io/@austonst-aestus/BJsvEoia6\n\nIt's a little long to copy directly onto Reddit, but I can provide and elaborate on the main points:\n\n* Block proposal timing games are unavoidable; at this point the best outcome is ensuring democratized access to high-quality timing management tools.\n* Aestus will apply a safe delay to all getHeader requests coming from validators identified by user agent.\n* Aestus's default timing games implementation results in a median delay of 735 ms.\n* Validators looking to be more conservative or more aggressive may customize parameters by appending `?headerDelay={ms}&headerCutoff={ms}` to the Aestus listing in their mev-boost relay list.\n* We encourage staking pools and relays to be transparent about timing games.\n\nIf you need some background on timing games, I provide a few links at the start. Timing games aren't a good thing in general: they're zero-sum for proposers and basically negative-sum when you consider the impact on network health. You can draw reasonable comparisons to an iterated n-player prisoner's dilemma, where once you know a handful of actors are always going to defect, it's in your best interest to defect as well, if only to mitigate your losses.\n\nBut this isn't too different from mev-boost: if we can't solve the problem (without protocol changes) we can at least reduce the advantage sophisticated actors have over everyone else. And when it comes to timing games, implementing them on the relay side with a careful eye towards consensus health should accomplish this. The article should cover the rest.\n\n----\n\nTo quickly address the current hot topic, the blob-shaped elephant in the room whose ISP strangles their upload bandwidth: yeah, relay-side timing games will delay block publication (that's the point), giving less time for blobs to propagate around the network. But when you accept a bid over mev-boost, *the relay*--with its well-connected clients and prime data center location--will be the one responsible for initial block propagation.\n\nIf you use mev-boost with relay-side timing games, the block may be delayed but you can trust the relay to propagate it fast. If you don't use mev-boost at all, your client will produce a block ASAP but you need to trust your own network to propagate it. The middle ground may be [more interesting](https://x.com/nero_eth/status/1841214520896663887): mev-boost with timing games AND a `--min-bid` means you delay block production but may end up responsible for your own block propagation.\n\n*If you're a validator concerned about local propagation after delays*, you could specify `?headerDelay=0` in your Aestus mev-boost entry to disable timing games at the cost of lowering bid value, though if you're doing that, make sure to also *remove* Ultrasound and BloXroute relays from your list, as they also run timing games (BloXroute does allow for timing configuration, but I think you need to pay for their validator gateway service separately). There's no point in making Aestus return a bid early if your mev-boost client is just going to sit there waiting 900 ms for the other relays' responses.\n\n----\n\nI'm always happy to discuss. Feel free to reply or reach out directly.","body_html":"<div class=\"md\"><p><em>Also posted in <a href=\"/r/ethstaker\">r/ethstaker</a>, but I don&#39;t think people will mind seeing it here too:</em></p>\n\n<p>I&#39;d like to share an article I&#39;ve written about what <a href=\"/u/KuDeTa\">u/KuDeTa</a> and I are doing with respect to block proposal timing games for the Aestus relay. We&#39;ve been experimenting with timing games for a while and in the interest of transparency would like to share our motivation, proposer-configurable parameters, and a bit of data.</p>\n\n<p>The full article is here: <a href=\"https://hackmd.io/@austonst-aestus/BJsvEoia6\">https://hackmd.io/@austonst-aestus/BJsvEoia6</a></p>\n\n<p>It&#39;s a little long to copy directly onto Reddit, but I can provide and elaborate on the main points:</p>\n\n<ul>\n<li>Block proposal timing games are unavoidable; at this point the best outcome is ensuring democratized access to high-quality timing management tools.</li>\n<li>Aestus will apply a safe delay to all getHeader requests coming from validators identified by user agent.</li>\n<li>Aestus&#39;s default timing games implementation results in a median delay of 735 ms.</li>\n<li>Validators looking to be more conservative or more aggressive may customize parameters by appending <code>?headerDelay={ms}&amp;headerCutoff={ms}</code> to the Aestus listing in their mev-boost relay list.</li>\n<li>We encourage staking pools and relays to be transparent about timing games.</li>\n</ul>\n\n<p>If you need some background on timing games, I provide a few links at the start. Timing games aren&#39;t a good thing in general: they&#39;re zero-sum for proposers and basically negative-sum when you consider the impact on network health. You can draw reasonable comparisons to an iterated n-player prisoner&#39;s dilemma, where once you know a handful of actors are always going to defect, it&#39;s in your best interest to defect as well, if only to mitigate your losses.</p>\n\n<p>But this isn&#39;t too different from mev-boost: if we can&#39;t solve the problem (without protocol changes) we can at least reduce the advantage sophisticated actors have over everyone else. And when it comes to timing games, implementing them on the relay side with a careful eye towards consensus health should accomplish this. The article should cover the rest.</p>\n\n<hr/>\n\n<p>To quickly address the current hot topic, the blob-shaped elephant in the room whose ISP strangles their upload bandwidth: yeah, relay-side timing games will delay block publication (that&#39;s the point), giving less time for blobs to propagate around the network. But when you accept a bid over mev-boost, <em>the relay</em>--with its well-connected clients and prime data center location--will be the one responsible for initial block propagation.</p>\n\n<p>If you use mev-boost with relay-side timing games, the block may be delayed but you can trust the relay to propagate it fast. If you don&#39;t use mev-boost at all, your client will produce a block ASAP but you need to trust your own network to propagate it. The middle ground may be <a href=\"https://x.com/nero_eth/status/1841214520896663887\">more interesting</a>: mev-boost with timing games AND a <code>--min-bid</code> means you delay block production but may end up responsible for your own block propagation.</p>\n\n<p><em>If you&#39;re a validator concerned about local propagation after delays</em>, you could specify <code>?headerDelay=0</code> in your Aestus mev-boost entry to disable timing games at the cost of lowering bid value, though if you&#39;re doing that, make sure to also <em>remove</em> Ultrasound and BloXroute relays from your list, as they also run timing games (BloXroute does allow for timing configuration, but I think you need to pay for their validator gateway service separately). There&#39;s no point in making Aestus return a bid early if your mev-boost client is just going to sit there waiting 900 ms for the other relays&#39; responses.</p>\n\n<hr/>\n\n<p>I&#39;m always happy to discuss. Feel free to reply or reach out directly.</p>\n</div>","created_utc":"2024-10-01 22:51:30","distinguished":null,"edited":"2024-10-02 11:58:53","id":"lpxpmjj","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":49,"stickied":false,"replies":[{"author":"u/haurog","body":"I dislike every part of this, but unfortunately timing games are a reality. Thank you for the transparency, making a reasonable compromise and especially the possibility to change the defaults. I think currently there is very little incentive for solo stakers to actively optimize for timing games as the execution layer income is just a small part of the overall income. As far as I see this year execution income is slightly above 10% of the overall staking income, at least for the 20 random validators I checked, and increasing that by timing games by another 1-2 percentage points is not really a lot. At least for me it is not worth it to compromise the network integrity over it. Obviously there are different opinions about it. If the MEV opportunity increases again it might become a more substantial part of the revenue. I think overall it shows for how little reward some actors are ready to compromise the Network. Not really surprising, but just interesting to keep in mind.","body_html":"<div class=\"md\"><p>I dislike every part of this, but unfortunately timing games are a reality. Thank you for the transparency, making a reasonable compromise and especially the possibility to change the defaults. I think currently there is very little incentive for solo stakers to actively optimize for timing games as the execution layer income is just a small part of the overall income. As far as I see this year execution income is slightly above 10% of the overall staking income, at least for the 20 random validators I checked, and increasing that by timing games by another 1-2 percentage points is not really a lot. At least for me it is not worth it to compromise the network integrity over it. Obviously there are different opinions about it. If the MEV opportunity increases again it might become a more substantial part of the revenue. I think overall it shows for how little reward some actors are ready to compromise the Network. Not really surprising, but just interesting to keep in mind.</p>\n</div>","created_utc":"2024-10-02 07:41:46","distinguished":null,"edited":false,"id":"lpzdwqu","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpxpmjj","score":12,"stickied":false,"replies":[{"author":"u/austonst","body":"That's a good point about execution income. Timing games shouldn't result in a massive increase in overall APR (and no *increase* really, just limiting the extent to which other actors can take that small % from you). But some people really do care about those little differences, so to the extent that we can mitigate the \"you make less money from solo staking than from holding an LST\" argument with a negligible impact on network health, I think it's worth the effort. Probably not worth it to push timing much further though.\n\nBut it's probably fair to say it's a bigger deal for us as the relay than it is for stakers. Because if proposers are requesting blocks from both Aestus and another relay, and we didn't delay while the other one delayed for 500-800 ms... we would never win a slot. Builders wouldn't see any value in sending us blocks, when the risk of of delivering stale, possibly cancelled blocks is much higher than the reward of winning the odd slot where we happened to get lucky. So they'd disconnect and we'd be kind of useless.\n\nThe only way to be a viable relay today is to play timing games. I just hope we can target a happy medium that's aggressive enough to retain builders but safe enough to have no noticeable impact on network health.","body_html":"<div class=\"md\"><p>That&#39;s a good point about execution income. Timing games shouldn&#39;t result in a massive increase in overall APR (and no <em>increase</em> really, just limiting the extent to which other actors can take that small % from you). But some people really do care about those little differences, so to the extent that we can mitigate the &quot;you make less money from solo staking than from holding an LST&quot; argument with a negligible impact on network health, I think it&#39;s worth the effort. Probably not worth it to push timing much further though.</p>\n\n<p>But it&#39;s probably fair to say it&#39;s a bigger deal for us as the relay than it is for stakers. Because if proposers are requesting blocks from both Aestus and another relay, and we didn&#39;t delay while the other one delayed for 500-800 ms... we would never win a slot. Builders wouldn&#39;t see any value in sending us blocks, when the risk of of delivering stale, possibly cancelled blocks is much higher than the reward of winning the odd slot where we happened to get lucky. So they&#39;d disconnect and we&#39;d be kind of useless.</p>\n\n<p>The only way to be a viable relay today is to play timing games. I just hope we can target a happy medium that&#39;s aggressive enough to retain builders but safe enough to have no noticeable impact on network health.</p>\n</div>","created_utc":"2024-10-02 08:51:49","distinguished":null,"edited":false,"id":"lpzqv7r","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpzdwqu","score":8,"stickied":false,"replies":[{"author":"u/haurog","body":"Thank you for your detailed answer and especially adding the viewpoint of a relayer. It really is obvious that as a relayer you either play timing games or you can close up shop. That is how the incentives work. And just to be clear if any part of my initial answer felt like an attack on what you and aestus are doing, that was definitely not my intention. I have nothing but the utmost respect for what you have been building in the last 2 years.\n\nA thought I had for a longer time now is the following. How difficult would it be to make an \"Ethereum Network Maxi\" relay as a smaller side relay with all the infrastructure you already have. This relay would only accept bids from builders which have a proven track record of not censoring transactions. Timing games would also be out of the question. The whole focus of this relay would be to be as good of a replacement of locally built blocks but with at least some MEV without some of the downsides. It would be a very opinionated relay. It would never be able to compete with the largest relays regarding rewards and it would only be able to cater to a small part of the Ethereum believers, because obviously you cannot connect to another relay as this would destroy the value proposition this relay would bring. Not sure it could ever get larger than 1% of the network. The interesting part might be that even though the relay would have a small share of the market it would be an exclusive relay. Some validators would only connect to this one and nothing else. If builders would want to catch a bid on a slot proposed from one of validators subscribed to only this relay they would have to make sure to have a non-censoring builder. At the beginning there would be fewer builders on this relay making it even more lucrative for the more sophisticated ones to jump on. That means even with a small market share it might be enough to have a larger leverage on the builder market. \n\nI am also asking this because in the last few months I have been thinking how I personally should handle the relay space. At the moment I connect to aestus, ultrasound relay and agnostic. Looking at the 'censorship.pics' site I will probably soon remove ultrasound relay. Too much censorship for my taste. Not horrible, but not good enough for me. The timing games are a further pain point which push me in the direction of starting to build all my blocks locally. I did so on and off for the last year already. An 'Ethereum Network Maxi' relay would convince me to stay with MEV boost and still profit from the additional MEV. Maybe there are some other Ethereum Network Maxis around which would be interested in something like this as well.","body_html":"<div class=\"md\"><p>Thank you for your detailed answer and especially adding the viewpoint of a relayer. It really is obvious that as a relayer you either play timing games or you can close up shop. That is how the incentives work. And just to be clear if any part of my initial answer felt like an attack on what you and aestus are doing, that was definitely not my intention. I have nothing but the utmost respect for what you have been building in the last 2 years.</p>\n\n<p>A thought I had for a longer time now is the following. How difficult would it be to make an &quot;Ethereum Network Maxi&quot; relay as a smaller side relay with all the infrastructure you already have. This relay would only accept bids from builders which have a proven track record of not censoring transactions. Timing games would also be out of the question. The whole focus of this relay would be to be as good of a replacement of locally built blocks but with at least some MEV without some of the downsides. It would be a very opinionated relay. It would never be able to compete with the largest relays regarding rewards and it would only be able to cater to a small part of the Ethereum believers, because obviously you cannot connect to another relay as this would destroy the value proposition this relay would bring. Not sure it could ever get larger than 1% of the network. The interesting part might be that even though the relay would have a small share of the market it would be an exclusive relay. Some validators would only connect to this one and nothing else. If builders would want to catch a bid on a slot proposed from one of validators subscribed to only this relay they would have to make sure to have a non-censoring builder. At the beginning there would be fewer builders on this relay making it even more lucrative for the more sophisticated ones to jump on. That means even with a small market share it might be enough to have a larger leverage on the builder market. </p>\n\n<p>I am also asking this because in the last few months I have been thinking how I personally should handle the relay space. At the moment I connect to aestus, ultrasound relay and agnostic. Looking at the &#39;censorship.pics&#39; site I will probably soon remove ultrasound relay. Too much censorship for my taste. Not horrible, but not good enough for me. The timing games are a further pain point which push me in the direction of starting to build all my blocks locally. I did so on and off for the last year already. An &#39;Ethereum Network Maxi&#39; relay would convince me to stay with MEV boost and still profit from the additional MEV. Maybe there are some other Ethereum Network Maxis around which would be interested in something like this as well.</p>\n</div>","created_utc":"2024-10-02 10:46:17","distinguished":null,"edited":false,"id":"lq0cqsh","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpzqv7r","score":6,"stickied":false,"replies":[{"author":"u/austonst","body":"I've thought about this too, usually I phrase it as an \"anti-censoring\" relay in contrast with today's censoring and non-censoring relays. But I like your framing as a replacement for local block building. So you get the local block production benefits of (some trust-based confidence of) not engaging in censorship, and publishing blocks as early as possible for network health. But at the same time the blocks are still built by builders, with better mempool observability and the possibility of some private order flow and MEV. And the relay would be propagating blocks so it's fast. Or even remove the delay in returning payloads to proposers, making ordering-centric MEV super risky so builders would exclude it, but letting the proposer help propagate ASAP.\n\nThe most likely way I think for this vision to be realized is better expression over validator preferences within a single relay. The helix relay codebase (Titan's) has a system more fleshed out for this; Flashbots' relay would need a moderate overhaul to do the same. Titan [already supports](https://docs.titanrelay.xyz/builders/builder-integration#get-validators) preferences for filtering (censorship) and selection of specific builders. It wouldn't be too big a step for this preference system to also control timing games. Since builders can read the preferences of the current proposer, they could decide which blocks to submit to the \"network maxis\"--probably not anything with replaceable bundles. You probably get something similar using today's Agnostic relay (no timing games as far as I'm aware) and/or timing-games-disabled Aestus, though kicking out the censoring builders entirely, and letting the rest know what you've done, is only really doable through Titan today.\n\nAs a separate relay, it would be a little more prominent as a focal point to advertise, though adoption is an issue. I think \"I'll add all the relays to my mev-boost config so I make the most money\" is a bit too popular a sentiment and should be discouraged. Once you've added multiple relays to your list, the only deciding factor in choosing between them is the strictly profit-maximizing auction, so initial relay selection is the only place (beyond Titan and now Aestus's systems) to express more nuanced preferences. And people simply don't do that enough. If I remember right, part of the reason BloXroute shut down their \"Ethical\" relay was because most people registered for Ethical... were simultaneously registered for Regulated or Max Profit.\n\nMaybe if we could secure a a solid 2-5% of the validator network to commit to \"Ethereum Network Maxi\" behavior, and assurance that these guys aren't going to ask for any bids elsewhere. With either a separate relay or a preference system like Titan's, either way making it obvious to builders that the proposer is going maxi-mode, then it would be a market builders would be forced to address.","body_html":"<div class=\"md\"><p>I&#39;ve thought about this too, usually I phrase it as an &quot;anti-censoring&quot; relay in contrast with today&#39;s censoring and non-censoring relays. But I like your framing as a replacement for local block building. So you get the local block production benefits of (some trust-based confidence of) not engaging in censorship, and publishing blocks as early as possible for network health. But at the same time the blocks are still built by builders, with better mempool observability and the possibility of some private order flow and MEV. And the relay would be propagating blocks so it&#39;s fast. Or even remove the delay in returning payloads to proposers, making ordering-centric MEV super risky so builders would exclude it, but letting the proposer help propagate ASAP.</p>\n\n<p>The most likely way I think for this vision to be realized is better expression over validator preferences within a single relay. The helix relay codebase (Titan&#39;s) has a system more fleshed out for this; Flashbots&#39; relay would need a moderate overhaul to do the same. Titan <a href=\"https://docs.titanrelay.xyz/builders/builder-integration#get-validators\">already supports</a> preferences for filtering (censorship) and selection of specific builders. It wouldn&#39;t be too big a step for this preference system to also control timing games. Since builders can read the preferences of the current proposer, they could decide which blocks to submit to the &quot;network maxis&quot;--probably not anything with replaceable bundles. You probably get something similar using today&#39;s Agnostic relay (no timing games as far as I&#39;m aware) and/or timing-games-disabled Aestus, though kicking out the censoring builders entirely, and letting the rest know what you&#39;ve done, is only really doable through Titan today.</p>\n\n<p>As a separate relay, it would be a little more prominent as a focal point to advertise, though adoption is an issue. I think &quot;I&#39;ll add all the relays to my mev-boost config so I make the most money&quot; is a bit too popular a sentiment and should be discouraged. Once you&#39;ve added multiple relays to your list, the only deciding factor in choosing between them is the strictly profit-maximizing auction, so initial relay selection is the only place (beyond Titan and now Aestus&#39;s systems) to express more nuanced preferences. And people simply don&#39;t do that enough. If I remember right, part of the reason BloXroute shut down their &quot;Ethical&quot; relay was because most people registered for Ethical... were simultaneously registered for Regulated or Max Profit.</p>\n\n<p>Maybe if we could secure a a solid 2-5% of the validator network to commit to &quot;Ethereum Network Maxi&quot; behavior, and assurance that these guys aren&#39;t going to ask for any bids elsewhere. With either a separate relay or a preference system like Titan&#39;s, either way making it obvious to builders that the proposer is going maxi-mode, then it would be a market builders would be forced to address.</p>\n</div>","created_utc":"2024-10-02 12:21:40","distinguished":null,"edited":false,"id":"lq0uowr","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq0cqsh","score":6,"stickied":false,"replies":[{"author":"u/haurog","body":"Thanks again for this detailed answer. I think I have nothing more to add, you covered pretty much the whole ground with its pros and cons. If any of these implementation possibilities would become a reality, I would love to use it. Thanks for referencing Titan relay. I wanted to look into them a bit more, but some short glances at censorship.pics made me think Titan is nothing for me. I will look into it a bit more now.","body_html":"<div class=\"md\"><p>Thanks again for this detailed answer. I think I have nothing more to add, you covered pretty much the whole ground with its pros and cons. If any of these implementation possibilities would become a reality, I would love to use it. Thanks for referencing Titan relay. I wanted to look into them a bit more, but some short glances at censorship.pics made me think Titan is nothing for me. I will look into it a bit more now.</p>\n</div>","created_utc":"2024-10-02 12:51:54","distinguished":null,"edited":false,"id":"lq10e0b","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq0uowr","score":5,"stickied":false,"replies":[{"author":"u/Kevkillerke","body":"Man, Haurog. It's always a pleasure reading conversations you are involved with. Keep it up!","body_html":"<div class=\"md\"><p>Man, Haurog. It&#39;s always a pleasure reading conversations you are involved with. Keep it up!</p>\n</div>","created_utc":"2024-10-02 16:25:04","distinguished":null,"edited":false,"id":"lq212a5","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq10e0b","score":5,"stickied":false,"replies":[{"author":"u/haurog","body":"Thank you.","body_html":"<div class=\"md\"><p>Thank you.</p>\n</div>","created_utc":"2024-10-02 23:17:16","distinguished":null,"edited":false,"id":"lq3klag","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq212a5","score":3,"stickied":false,"replies":[]}]}]}]}]}]}]},{"author":"u/Tricky_Troll","body":">If you need some background on timing games, I provide a few links at the start. Timing games aren't a good thing in general: they're zero-sum for proposers and basically negative-sum when you consider the impact on network health. You can draw reasonable comparisons to an iterated n-player prisoner's dilemma, where once you know a handful of actors are always going to defect, it's in your best interest to defect as well, if only to mitigate your losses.\n\n>But this isn't too different from mev-boost: if we can't solve the problem (without protocol changes) we can at least reduce the advantage sophisticated actors have over everyone else. And when it comes to timing games, implementing them on the relay side with a careful eye towards consensus health should accomplish this. The article should cover the rest.\n\nThis is such a great summary. Thanks for your transparency and sharing this with us! It's both good for those of us wanting to stay in the loop with Aestus (especially us solo stakers) and for people who aren't familiar with timing games and now have a new rabbit hole to dive into.","body_html":"<div class=\"md\"><blockquote>\n<p>If you need some background on timing games, I provide a few links at the start. Timing games aren&#39;t a good thing in general: they&#39;re zero-sum for proposers and basically negative-sum when you consider the impact on network health. You can draw reasonable comparisons to an iterated n-player prisoner&#39;s dilemma, where once you know a handful of actors are always going to defect, it&#39;s in your best interest to defect as well, if only to mitigate your losses.</p>\n\n<p>But this isn&#39;t too different from mev-boost: if we can&#39;t solve the problem (without protocol changes) we can at least reduce the advantage sophisticated actors have over everyone else. And when it comes to timing games, implementing them on the relay side with a careful eye towards consensus health should accomplish this. The article should cover the rest.</p>\n</blockquote>\n\n<p>This is such a great summary. Thanks for your transparency and sharing this with us! It&#39;s both good for those of us wanting to stay in the loop with Aestus (especially us solo stakers) and for people who aren&#39;t familiar with timing games and now have a new rabbit hole to dive into.</p>\n</div>","created_utc":"2024-10-02 03:56:38","distinguished":null,"edited":false,"id":"lpygvot","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpxpmjj","score":10,"stickied":false,"replies":[]},{"author":"u/eth2353","body":"My full reply is [over in r/ethstaker](https://www.reddit.com/r/ethstaker/comments/1fu7cad/aestus_relay_timing_games_as_a_service/lpye99d/) , here's the gist of it:\n\n- love the transparency and configurability - opt-out possibility is nice\n- I personally am now okay with proposing up to 1 second into the slot as the negative effect of that seems to be very limited. Therefore, I am okay with relays democratizing access to this sort of game in a responsible way - like you're doing - leveling the playing field.\n- a good source of very up-to-date and accessible information on the current situation with timing games is [this Indexed Podcast episode from 2 weeks ago](https://x.com/indexed_pod/status/1837151576320090414)\n- Kiln has gone beyond what I deem acceptable, delaying proposals up to 2.5 seconds into the slot. At that point, 10% of stakers miss the head vote on those blocks (because they see it too late). The people most affected by this are probably home stakers, who will get lower rewards because of Kiln's behavior.\n- In the interest of transparency, we at Serenita do not actively play timing games, aiming to propose up to 1 second into the slot using the client defaults.","body_html":"<div class=\"md\"><p>My full reply is <a href=\"https://www.reddit.com/r/ethstaker/comments/1fu7cad/aestus_relay_timing_games_as_a_service/lpye99d/\">over in r/ethstaker</a> , here&#39;s the gist of it:</p>\n\n<ul>\n<li>love the transparency and configurability - opt-out possibility is nice</li>\n<li>I personally am now okay with proposing up to 1 second into the slot as the negative effect of that seems to be very limited. Therefore, I am okay with relays democratizing access to this sort of game in a responsible way - like you&#39;re doing - leveling the playing field.</li>\n<li>a good source of very up-to-date and accessible information on the current situation with timing games is <a href=\"https://x.com/indexed_pod/status/1837151576320090414\">this Indexed Podcast episode from 2 weeks ago</a></li>\n<li>Kiln has gone beyond what I deem acceptable, delaying proposals up to 2.5 seconds into the slot. At that point, 10% of stakers miss the head vote on those blocks (because they see it too late). The people most affected by this are probably home stakers, who will get lower rewards because of Kiln&#39;s behavior.</li>\n<li>In the interest of transparency, we at Serenita do not actively play timing games, aiming to propose up to 1 second into the slot using the client defaults.</li>\n</ul>\n</div>","created_utc":"2024-10-02 04:58:53","distinguished":null,"edited":false,"id":"lpyobui","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpxpmjj","score":8,"stickied":false,"replies":[]}]},{"author":"u/smidge","body":"But, I was promised...\n\n*goes through documents*\n\nFucktober!?","body_html":"<div class=\"md\"><p>But, I was promised...</p>\n\n<p><em>goes through documents</em></p>\n\n<p>Fucktober!?</p>\n</div>","created_utc":"2024-10-02 01:09:05","distinguished":null,"edited":false,"id":"lpy1x81","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":30,"stickied":false,"replies":[{"author":"u/physalisx","body":"up-yours-tober","body_html":"<div class=\"md\"><p>up-yours-tober</p>\n</div>","created_utc":"2024-10-02 02:19:02","distinguished":null,"edited":false,"id":"lpy7r3w","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpy1x81","score":12,"stickied":false,"replies":[]},{"author":"u/Fedacti","body":"It's actually octotober \n\nWhich either means ethereums tentacles will encompass the entire world, or an eth price of $8. \n\n**Or both !**","body_html":"<div class=\"md\"><p>It&#39;s actually octotober </p>\n\n<p>Which either means ethereums tentacles will encompass the entire world, or an eth price of $8. </p>\n\n<p><strong>Or both !</strong></p>\n</div>","created_utc":"2024-10-02 03:10:02","distinguished":null,"edited":false,"id":"lpyc7zt","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpy1x81","score":10,"stickied":false,"replies":[]},{"author":"u/Inevitablechained","body":"Octo-bear-whelmed?","body_html":"<div class=\"md\"><p>Octo-bear-whelmed?</p>\n</div>","created_utc":"2024-10-02 02:30:56","distinguished":null,"edited":false,"id":"lpy8qvn","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpy1x81","score":4,"stickied":false,"replies":[]},{"author":"u/2peg2city","body":"Little thing in the middle east svsring markets","body_html":"<div class=\"md\"><p>Little thing in the middle east svsring markets</p>\n</div>","created_utc":"2024-10-02 05:56:45","distinguished":null,"edited":false,"id":"lpywesd","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpy1x81","score":2,"stickied":false,"replies":[]},{"author":"u/twobadkidsin412","body":"Fuck-u-tober","body_html":"<div class=\"md\"><p>Fuck-u-tober</p>\n</div>","created_utc":"2024-10-02 15:26:14","distinguished":null,"edited":false,"id":"lq1sd2l","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpy1x81","score":1,"stickied":false,"replies":[]}]},{"author":"[deleted]","body":"[deleted]","body_html":"<div class=\"md\"><p>[deleted]</p>\n</div>","created_utc":"2024-10-02 06:15:43","distinguished":null,"edited":false,"id":"lpyzaz6","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":28,"stickied":false,"replies":[{"author":"u/15kisFUD","body":"Anyone that wants to be a mod there can dm me","body_html":"<div class=\"md\"><p>Anyone that wants to be a mod there can dm me</p>\n</div>","created_utc":"2024-10-02 06:20:47","distinguished":null,"edited":false,"id":"lpz03oh","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpyzaz6","score":12,"stickied":false,"replies":[]},{"author":"u/Gumba_Hasselhoff","body":"I would like to whine that my limit order hasn't been hit yet","body_html":"<div class=\"md\"><p>I would like to whine that my limit order hasn&#39;t been hit yet</p>\n</div>","created_utc":"2024-10-02 07:40:46","distinguished":null,"edited":false,"id":"lpzdq4s","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpyzaz6","score":3,"stickied":false,"replies":[{"author":"[deleted]","body":"Zoom out and be patient","body_html":"<div class=\"md\"><p>Zoom out and be patient</p>\n</div>","created_utc":"2024-10-02 07:45:33","distinguished":null,"edited":false,"id":"lpzelhn","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpzdq4s","score":6,"stickied":false,"replies":[]}]},{"author":"u/LogrisTheBard","body":"I never visited there, did we wind it down?","body_html":"<div class=\"md\"><p>I never visited there, did we wind it down?</p>\n</div>","created_utc":"2024-10-02 09:33:22","distinguished":null,"edited":false,"id":"lpzyw6u","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpyzaz6","score":4,"stickied":false,"replies":[]}]},{"author":"u/InclineDumbbellPress","body":"Dont mind me just stopping by to say Ethereum","body_html":"<div class=\"md\"><p>Dont mind me just stopping by to say Ethereum</p>\n</div>","created_utc":"2024-10-02 02:57:41","distinguished":null,"edited":false,"id":"lpyb3b1","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":23,"stickied":false,"replies":[]},{"author":"[deleted]","body":"[deleted]","body_html":"<div class=\"md\"><p>[deleted]</p>\n</div>","created_utc":"2024-10-02 11:59:23","distinguished":null,"edited":false,"id":"lq0qitv","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":17,"stickied":false,"replies":[]},{"author":"u/coinanon","body":"USDC borrow rates on Aave have spiked a few times this week, jumping to 10% or 15%, then back down a few hours later. Does anyone know what causes this?\nhttps://aavescan.com/ethereum-v3/0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb480x2f39d218133afab8f2b819b1066c7e434ad94e9e\n\nI'd rather avoid USDT, but the typical rate is a bit lower and it hasn't had crazy spikes like this.","body_html":"<div class=\"md\"><p>USDC borrow rates on Aave have spiked a few times this week, jumping to 10% or 15%, then back down a few hours later. Does anyone know what causes this?\n<a href=\"https://aavescan.com/ethereum-v3/0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb480x2f39d218133afab8f2b819b1066c7e434ad94e9e\">https://aavescan.com/ethereum-v3/0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb480x2f39d218133afab8f2b819b1066c7e434ad94e9e</a></p>\n\n<p>I&#39;d rather avoid USDT, but the typical rate is a bit lower and it hasn&#39;t had crazy spikes like this.</p>\n</div>","created_utc":"2024-10-01 23:39:57","distinguished":null,"edited":false,"id":"lpxu6rf","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":18,"stickied":false,"replies":[{"author":"u/Twelvemeatballs","body":"I pulled my USDC off of AAVE last week so this is probably my fault.","body_html":"<div class=\"md\"><p>I pulled my USDC off of AAVE last week so this is probably my fault.</p>\n</div>","created_utc":"2024-10-02 01:39:43","distinguished":null,"edited":false,"id":"lpy4gpk","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpxu6rf","score":8,"stickied":false,"replies":[]},{"author":"u/defewit","body":"Rates are just in inverse proportion (along a curve) to the amount of USDC reserves, so spikes mean reserves are suddenly removed. Most impactful cause I would speculate is spiky demand for (de)leverage.","body_html":"<div class=\"md\"><p>Rates are just in inverse proportion (along a curve) to the amount of USDC reserves, so spikes mean reserves are suddenly removed. Most impactful cause I would speculate is spiky demand for (de)leverage.</p>\n</div>","created_utc":"2024-10-02 02:41:52","distinguished":null,"edited":false,"id":"lpy9or4","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpxu6rf","score":6,"stickied":false,"replies":[]}]},{"author":"u/growthepie_eth","body":"Layer 2 Economics - growthepie has just launched a new page - [https://www.growthepie.xyz/economics](https://www.growthepie.xyz/economics)  \n- See Revenue, Costs, and Profit aggregated for all Layer 2s.  \n- You can also click into each Layer 2 to visualize: Revenue | Costs (L1 / Blobs) | Profit & Loss | Margin | Blob Data (GB)  \n- You can filter by DA provider by clicking on \"Data Availibitly\" and you can sort by any of the columns \n\nWe would love any feedback and we are building a lot more metrics for you guys too!","body_html":"<div class=\"md\"><p>Layer 2 Economics - growthepie has just launched a new page - <a href=\"https://www.growthepie.xyz/economics\">https://www.growthepie.xyz/economics</a><br/>\n- See Revenue, Costs, and Profit aggregated for all Layer 2s.<br/>\n- You can also click into each Layer 2 to visualize: Revenue | Costs (L1 / Blobs) | Profit &amp; Loss | Margin | Blob Data (GB)<br/>\n- You can filter by DA provider by clicking on &quot;Data Availibitly&quot; and you can sort by any of the columns </p>\n\n<p>We would love any feedback and we are building a lot more metrics for you guys too!</p>\n</div>","created_utc":"2024-10-02 06:02:49","distinguished":null,"edited":false,"id":"lpyxbvv","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":33,"stickied":false,"replies":[{"author":"u/parsimonyBase","body":"Great site.","body_html":"<div class=\"md\"><p>Great site.</p>\n</div>","created_utc":"2024-10-02 15:16:17","distinguished":null,"edited":false,"id":"lq1r5w3","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpyxbvv","score":4,"stickied":false,"replies":[{"author":"u/growthepie_eth","body":"Thanks, glad you like it!","body_html":"<div class=\"md\"><p>Thanks, glad you like it!</p>\n</div>","created_utc":"2024-10-02 15:46:30","distinguished":null,"edited":false,"id":"lq1v8vp","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1r5w3","score":1,"stickied":false,"replies":[]}]},{"author":"u/sosayethweall","body":"It chokes up a lot on mobile, but I love what I see.","body_html":"<div class=\"md\"><p>It chokes up a lot on mobile, but I love what I see.</p>\n</div>","created_utc":"2024-10-03 01:25:06","distinguished":null,"edited":false,"id":"lq3vg68","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpyxbvv","score":2,"stickied":false,"replies":[{"author":"u/growthepie_eth","body":"Would you be happy to share what phone and browser you use? (can dm me if you prefer)  \nI would like to feed this back to the devs - thanks for your feedback!","body_html":"<div class=\"md\"><p>Would you be happy to share what phone and browser you use? (can dm me if you prefer)<br/>\nI would like to feed this back to the devs - thanks for your feedback!</p>\n</div>","created_utc":"2024-10-03 09:09:51","distinguished":null,"edited":false,"id":"lq5oyjd","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq3vg68","score":1,"stickied":false,"replies":[]}]}]},{"author":"u/Alatarlhun","body":"I wrote some custom indicators years ago that I find super helpful personally to take the emotion out of investment decisions.  \n\nWhat is funny (to me) is that this sub's high pitched noises is just as predictive as those indicators on the 4h timeframe.  🤣","body_html":"<div class=\"md\"><p>I wrote some custom indicators years ago that I find super helpful personally to take the emotion out of investment decisions.  </p>\n\n<p>What is funny (to me) is that this sub&#39;s high pitched noises is just as predictive as those indicators on the 4h timeframe.  🤣</p>\n</div>","created_utc":"2024-10-02 06:49:20","distinguished":null,"edited":false,"id":"lpz4pvj","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":11,"stickied":false,"replies":[{"author":"u/Itur_ad_Astra","body":"What do these indicators predict?","body_html":"<div class=\"md\"><p>What do these indicators predict?</p>\n</div>","created_utc":"2024-10-02 07:55:39","distinguished":null,"edited":false,"id":"lpzggad","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpz4pvj","score":5,"stickied":false,"replies":[{"author":"u/Alatarlhun","body":"In this case, capitulation.","body_html":"<div class=\"md\"><p>In this case, capitulation.</p>\n</div>","created_utc":"2024-10-02 08:42:14","distinguished":null,"edited":false,"id":"lpzp2bz","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpzggad","score":5,"stickied":false,"replies":[{"author":"u/Itur_ad_Astra","body":"So, further down?\n\nOr we are already in capitulation and we'll stabilize?\n\nYou aren't very clear...","body_html":"<div class=\"md\"><p>So, further down?</p>\n\n<p>Or we are already in capitulation and we&#39;ll stabilize?</p>\n\n<p>You aren&#39;t very clear...</p>\n</div>","created_utc":"2024-10-02 09:54:09","distinguished":null,"edited":false,"id":"lq02uq9","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpzp2bz","score":1,"stickied":false,"replies":[{"author":"u/tutamtumikia","body":"That's a feature not a bug","body_html":"<div class=\"md\"><p>That&#39;s a feature not a bug</p>\n</div>","created_utc":"2024-10-02 14:29:32","distinguished":null,"edited":false,"id":"lq1j0b4","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq02uq9","score":2,"stickied":false,"replies":[]},{"author":"u/Alatarlhun","body":"I am using finance words that have an explicit meaning in this context.  \n\nhttps://www.investopedia.com/terms/c/capitulation.asp","body_html":"<div class=\"md\"><p>I am using finance words that have an explicit meaning in this context.  </p>\n\n<p><a href=\"https://www.investopedia.com/terms/c/capitulation.asp\">https://www.investopedia.com/terms/c/capitulation.asp</a></p>\n</div>","created_utc":"2024-10-02 09:56:12","distinguished":null,"edited":false,"id":"lq038vd","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq02uq9","score":0,"stickied":false,"replies":[{"author":"u/Itur_ad_Astra","body":"I know what capitulation is, don't be patronizing.\n\nYou didn't specify if it has already happened, or if it will happen soon.","body_html":"<div class=\"md\"><p>I know what capitulation is, don&#39;t be patronizing.</p>\n\n<p>You didn&#39;t specify if it has already happened, or if it will happen soon.</p>\n</div>","created_utc":"2024-10-02 10:07:51","distinguished":null,"edited":false,"id":"lq05fr9","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq038vd","score":4,"stickied":false,"replies":[{"author":"u/Alatarlhun","body":"I'd hesitate to broadly say capitulation on the 4h timeframe is a meaningful indicator of anything but a short term reversal.  \n\nThat said, we are near [two key supports](https://old.reddit.com/r/ethfinance/comments/1fazb7o/daily_general_discussion_september_7_2024/lly2c2y/?context=3) on longer timeframes so I'd suggest true capitulation already happened in June '22 and Oct '23.  \n\nWithout a more meaningful crash below 2400 than what we got in early August and early September this just seems like a small dip in an upward trend.","body_html":"<div class=\"md\"><p>I&#39;d hesitate to broadly say capitulation on the 4h timeframe is a meaningful indicator of anything but a short term reversal.  </p>\n\n<p>That said, we are near <a href=\"https://old.reddit.com/r/ethfinance/comments/1fazb7o/daily_general_discussion_september_7_2024/lly2c2y/?context=3\">two key supports</a> on longer timeframes so I&#39;d suggest true capitulation already happened in June &#39;22 and Oct &#39;23.  </p>\n\n<p>Without a more meaningful crash below 2400 than what we got in early August and early September this just seems like a small dip in an upward trend.</p>\n</div>","created_utc":"2024-10-02 10:25:03","distinguished":null,"edited":false,"id":"lq08p5y","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq05fr9","score":1,"stickied":false,"replies":[]}]}]}]}]}]},{"author":"u/etheraider","body":"I regularly check this sub for bottom signals and top signals over the years.","body_html":"<div class=\"md\"><p>I regularly check this sub for bottom signals and top signals over the years.</p>\n</div>","created_utc":"2024-10-02 12:41:53","distinguished":null,"edited":false,"id":"lq0yi3e","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpz4pvj","score":6,"stickied":false,"replies":[]},{"author":"u/DayTraderBiH","body":"So what does your magic indicator say? When $10k ?!?","body_html":"<div class=\"md\"><p>So what does your magic indicator say? When $10k ?!?</p>\n</div>","created_utc":"2024-10-02 10:27:46","distinguished":null,"edited":false,"id":"lq0980p","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpz4pvj","score":2,"stickied":false,"replies":[{"author":"u/Alatarlhun","body":"My indicators don't predict time, just volatility bands.  My thesis is $10k+.","body_html":"<div class=\"md\"><p>My indicators don&#39;t predict time, just volatility bands.  My thesis is $10k+.</p>\n</div>","created_utc":"2024-10-02 10:33:40","distinguished":null,"edited":false,"id":"lq0acrd","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq0980p","score":4,"stickied":false,"replies":[]}]}]},{"author":"[deleted]","body":"[deleted]","body_html":"<div class=\"md\"><p>[deleted]</p>\n</div>","created_utc":"2024-10-02 13:00:49","distinguished":null,"edited":false,"id":"lq122tq","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":13,"stickied":false,"replies":[{"author":"u/hanniabu","body":"I don't think I've ever met somebody as a better market indicator as you 😂","body_html":"<div class=\"md\"><p>I don&#39;t think I&#39;ve ever met somebody as a better market indicator as you 😂</p>\n</div>","created_utc":"2024-10-02 14:05:05","distinguished":null,"edited":false,"id":"lq1efma","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq122tq","score":5,"stickied":false,"replies":[]},{"author":"u/Lazy_Physicist","body":"this is pretty much why the only loans i ever take are alchemix loans. I really don't want there to be even the smallest chance of liquidation...","body_html":"<div class=\"md\"><p>this is pretty much why the only loans i ever take are alchemix loans. I really don&#39;t want there to be even the smallest chance of liquidation...</p>\n</div>","created_utc":"2024-10-02 15:36:52","distinguished":null,"edited":false,"id":"lq1txr3","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq122tq","score":3,"stickied":false,"replies":[{"author":"u/Kevkillerke","body":"Wow, Alchemix is a name I haven't heard in a good while... I should check them out again, when thinking about leverage","body_html":"<div class=\"md\"><p>Wow, Alchemix is a name I haven&#39;t heard in a good while... I should check them out again, when thinking about leverage</p>\n</div>","created_utc":"2024-10-02 16:12:17","distinguished":null,"edited":false,"id":"lq1z2am","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1txr3","score":4,"stickied":false,"replies":[{"author":"u/FernadoPoo","body":"You could do the same kind of thing at AAVE, borrowing ETH against cbETH or wstETH as collateral. With time the combined position of debt and collateral grows in value as measured in ETH, so the loan sort of pays itself off.  Maybe less smart contract risk than Alchemix.","body_html":"<div class=\"md\"><p>You could do the same kind of thing at AAVE, borrowing ETH against cbETH or wstETH as collateral. With time the combined position of debt and collateral grows in value as measured in ETH, so the loan sort of pays itself off.  Maybe less smart contract risk than Alchemix.</p>\n</div>","created_utc":"2024-10-02 17:58:25","distinguished":null,"edited":false,"id":"lq2fr8m","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1z2am","score":2,"stickied":false,"replies":[]},{"author":"u/Stobie","body":"Weren't their synths irrecoverably unbacked after the protocol controlled value was put in a protocol that got exploited?","body_html":"<div class=\"md\"><p>Weren&#39;t their synths irrecoverably unbacked after the protocol controlled value was put in a protocol that got exploited?</p>\n</div>","created_utc":"2024-10-02 16:37:29","distinguished":null,"edited":false,"id":"lq230f3","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1z2am","score":2,"stickied":false,"replies":[{"author":"u/Lazy_Physicist","body":"depends on what you mean by irrecoverably unbacked. alEth's value did drop to a low of something like 0.75 eth but is now stable around 0.91 eth after a repayment plan. It may not be back to 1 eth but you can still use alchemix roughly the same way unless you're dealing with a very large size. alUSD is basically at 1 USD, maybe closer to $0.99.","body_html":"<div class=\"md\"><p>depends on what you mean by irrecoverably unbacked. alEth&#39;s value did drop to a low of something like 0.75 eth but is now stable around 0.91 eth after a repayment plan. It may not be back to 1 eth but you can still use alchemix roughly the same way unless you&#39;re dealing with a very large size. alUSD is basically at 1 USD, maybe closer to $0.99.</p>\n</div>","created_utc":"2024-10-03 21:51:27","distinguished":null,"edited":false,"id":"lq97sm4","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq230f3","score":1,"stickied":false,"replies":[]}]}]}]}]},{"author":"u/benido2030","body":"Whoever thought it was a good idea to create \"sparks\" deserves time in jail. I was trying to mint stuff for Farcaster via Zora and on different chains (ARB, OP, Mainnet) I had this \"token\". Searched for it in Etherscan, didn't find anything. Took me some minutes to figure this out. Confusing... \n\nI understand unit bias, but this is not a good innovation I believe :(","body_html":"<div class=\"md\"><p>Whoever thought it was a good idea to create &quot;sparks&quot; deserves time in jail. I was trying to mint stuff for Farcaster via Zora and on different chains (ARB, OP, Mainnet) I had this &quot;token&quot;. Searched for it in Etherscan, didn&#39;t find anything. Took me some minutes to figure this out. Confusing... </p>\n\n<p>I understand unit bias, but this is not a good innovation I believe :(</p>\n</div>","created_utc":"2024-10-02 00:43:41","distinguished":null,"edited":false,"id":"lpxzsez","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":12,"stickied":false,"replies":[{"author":"u/Tiny-Height1967","body":"Is this 'anything but the metric system' again? In this case it's the SI system, but why the need to reinvent everything *again* after already inventing wei the first time round?!","body_html":"<div class=\"md\"><p>Is this &#39;anything but the metric system&#39; again? In this case it&#39;s the SI system, but why the need to reinvent everything <em>again</em> after already inventing wei the first time round?!</p>\n</div>","created_utc":"2024-10-02 01:01:04","distinguished":null,"edited":false,"id":"lpy18zb","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpxzsez","score":6,"stickied":false,"replies":[]}]},{"author":"u/tokenizedhuman","body":"Withdrew Eigen, immediately sold it for Eth. Ruthless.","body_html":"<div class=\"md\"><p>Withdrew Eigen, immediately sold it for Eth. Ruthless.</p>\n</div>","created_utc":"2024-10-02 04:55:46","distinguished":null,"edited":false,"id":"lpynxjr","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":12,"stickied":false,"replies":[]},{"author":"u/UgotTrisomy21","body":"Ethereum","body_html":"<div class=\"md\"><p>Ethereum</p>\n</div>","created_utc":"2024-10-01 22:01:43","distinguished":null,"edited":false,"id":"lpxkher","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":23,"stickied":false,"replies":[{"author":"u/FrenktheTank","body":"2486.89","body_html":"<div class=\"md\"><p>2486.89</p>\n</div>","created_utc":"2024-10-01 22:25:25","distinguished":null,"edited":false,"id":"lpxmzw1","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpxkher","score":14,"stickied":false,"replies":[]},{"author":"u/jaskidd05","body":"0,0403","body_html":"<div class=\"md\"><p>0,0403</p>\n</div>","created_utc":"2024-10-01 22:54:45","distinguished":null,"edited":false,"id":"lpxpxxn","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpxkher","score":14,"stickied":false,"replies":[]},{"author":"u/Defacticool","body":"Credibly neutral global settlement layer","body_html":"<div class=\"md\"><p>Credibly neutral global settlement layer</p>\n</div>","created_utc":"2024-10-01 22:17:32","distinguished":null,"edited":false,"id":"lpxm69t","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpxkher","score":11,"stickied":false,"replies":[]},{"author":"[deleted]","body":"Probably like 2340 or something","body_html":"<div class=\"md\"><p>Probably like 2340 or something</p>\n</div>","created_utc":"2024-10-01 22:07:46","distinguished":null,"edited":false,"id":"lpxl4zv","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpxkher","score":6,"stickied":false,"replies":[]}]},{"author":"u/Tricky_Troll","body":"Guys, it's literally the second day of Uptober. Be patient or go back to r/ethwhinance.","body_html":"<div class=\"md\"><p>Guys, it&#39;s literally the second day of Uptober. Be patient or go back to <a href=\"/r/ethwhinance\">r/ethwhinance</a>.</p>\n</div>","created_utc":"2024-10-02 03:59:30","distinguished":null,"edited":false,"id":"lpyh6my","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":31,"stickied":false,"replies":[{"author":"u/namtaru_x","body":"I prefer everyone dooming...... If everyone thinks number go up, then it won't. That's how it works, right?","body_html":"<div class=\"md\"><p>I prefer everyone dooming...... If everyone thinks number go up, then it won&#39;t. That&#39;s how it works, right?</p>\n</div>","created_utc":"2024-10-02 07:49:04","distinguished":null,"edited":false,"id":"lpzf8q3","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpyh6my","score":4,"stickied":false,"replies":[]}]},{"author":"u/vedran_","body":"Snowden [not holding back on Solana criticism](https://x.com/StakeWithPride/status/1841147593671561685)! Funny shit!","body_html":"<div class=\"md\"><p>Snowden <a href=\"https://x.com/StakeWithPride/status/1841147593671561685\">not holding back on Solana criticism</a>! Funny shit!</p>\n</div>","created_utc":"2024-10-02 06:55:54","distinguished":null,"edited":false,"id":"lpz5txq","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":37,"stickied":false,"replies":[{"author":"u/haurog","body":"The overall talk is quite interesting: https://www.youtube.com/watch?v=XD-XU6Y3TfA\n\nHe is always a good reminder of what can happen if one goes against the powers that be and this has given him obvious insights into how the world works.","body_html":"<div class=\"md\"><p>The overall talk is quite interesting: <a href=\"https://www.youtube.com/watch?v=XD-XU6Y3TfA\">https://www.youtube.com/watch?v=XD-XU6Y3TfA</a></p>\n\n<p>He is always a good reminder of what can happen if one goes against the powers that be and this has given him obvious insights into how the world works.</p>\n</div>","created_utc":"2024-10-02 08:06:16","distinguished":null,"edited":false,"id":"lpzievj","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpz5txq","score":18,"stickied":false,"replies":[]}]},{"author":"[deleted]","body":"A little market lingo for noobs, when a pump falls back a little bit after sustained upward movement, it’s called a “correction”\n\nWhen it falls back completely then dumps even further from where it started, it’s called “ethereum”","body_html":"<div class=\"md\"><p>A little market lingo for noobs, when a pump falls back a little bit after sustained upward movement, it’s called a “correction”</p>\n\n<p>When it falls back completely then dumps even further from where it started, it’s called “ethereum”</p>\n</div>","created_utc":"2024-10-02 06:50:33","distinguished":null,"edited":"2024-10-02 07:10:54","id":"lpz4x4i","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":44,"stickied":false,"replies":[{"author":"u/fecalreceptacle","body":"Take an upvote, my friend. This was pretty funny","body_html":"<div class=\"md\"><p>Take an upvote, my friend. This was pretty funny</p>\n</div>","created_utc":"2024-10-02 07:07:09","distinguished":null,"edited":"2024-10-02 07:10:27","id":"lpz7rjm","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpz4x4i","score":9,"stickied":false,"replies":[]}]},{"author":"[deleted]","body":"[deleted]","body_html":"<div class=\"md\"><p>[deleted]</p>\n</div>","created_utc":"2024-10-02 09:34:38","distinguished":null,"edited":false,"id":"lpzz4oi","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":19,"stickied":false,"replies":[{"author":"u/Stobie","body":"List of drops which outperformed ether:","body_html":"<div class=\"md\"><p>List of drops which outperformed ether:</p>\n</div>","created_utc":"2024-10-02 16:42:17","distinguished":null,"edited":false,"id":"lq23rc8","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpzz4oi","score":1,"stickied":false,"replies":[]}]},{"author":"u/danarchist","body":"Just got a Celsius payment at noon today, almost missed it. 60% of my btc holdings there. I never thought I'd actually see it.","body_html":"<div class=\"md\"><p>Just got a Celsius payment at noon today, almost missed it. 60% of my btc holdings there. I never thought I&#39;d actually see it.</p>\n</div>","created_utc":"2024-10-02 20:36:08","distinguished":null,"edited":false,"id":"lq338a4","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":18,"stickied":false,"replies":[{"author":"[deleted]","body":"That’s great. Congratulations. I’m happy for you.","body_html":"<div class=\"md\"><p>That’s great. Congratulations. I’m happy for you.</p>\n</div>","created_utc":"2024-10-02 20:44:39","distinguished":null,"edited":false,"id":"lq34bkw","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq338a4","score":2,"stickied":false,"replies":[]}]},{"author":"u/18boro","body":"I know the sources are not great, but assuming this is true: Franklin Templeton now has assets on Avalanche and Aptos. First off, disappointed and really surprised they don't opt for ethereum, second it's weird since they make money off ETH ETF and third I can't fathom they dare take the risk. Avalanche is somewhat tested, but Aptos, really? \n\nCan anyone make sense of this?\n\nTweet: https://x.com/WuBlockchain/status/1841471599415071083","body_html":"<div class=\"md\"><p>I know the sources are not great, but assuming this is true: Franklin Templeton now has assets on Avalanche and Aptos. First off, disappointed and really surprised they don&#39;t opt for ethereum, second it&#39;s weird since they make money off ETH ETF and third I can&#39;t fathom they dare take the risk. Avalanche is somewhat tested, but Aptos, really? </p>\n\n<p>Can anyone make sense of this?</p>\n\n<p>Tweet: <a href=\"https://x.com/WuBlockchain/status/1841471599415071083\">https://x.com/WuBlockchain/status/1841471599415071083</a></p>\n</div>","created_utc":"2024-10-02 10:29:12","distinguished":null,"edited":false,"id":"lq09i0m","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":8,"stickied":false,"replies":[{"author":"u/Stobie","body":"Probably incentives we don't see, and aptos would probably fork for them if something went wrong. What goes on on other chains is basically obfuscated compared to transparency of ethereum state.","body_html":"<div class=\"md\"><p>Probably incentives we don&#39;t see, and aptos would probably fork for them if something went wrong. What goes on on other chains is basically obfuscated compared to transparency of ethereum state.</p>\n</div>","created_utc":"2024-10-02 16:39:18","distinguished":null,"edited":false,"id":"lq23amz","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq09i0m","score":5,"stickied":false,"replies":[]}]},{"author":"u/fecalreceptacle","body":"Does anyone know what happened with the Orbiter 'points'? I have quite a few, and under 'reward', which I haven't seen before, it says I get nothing.\n\nPlease someone tell me that I didn't actually go out of my way to send funds using *one* address to generate points, just to get nothing?\n\nAnd I actually profited from the Hop airdrop, even though they're known for their high fees...\n\nInteresting","body_html":"<div class=\"md\"><p>Does anyone know what happened with the Orbiter &#39;points&#39;? I have quite a few, and under &#39;reward&#39;, which I haven&#39;t seen before, it says I get nothing.</p>\n\n<p>Please someone tell me that I didn&#39;t actually go out of my way to send funds using <em>one</em> address to generate points, just to get nothing?</p>\n\n<p>And I actually profited from the Hop airdrop, even though they&#39;re known for their high fees...</p>\n\n<p>Interesting</p>\n</div>","created_utc":"2024-10-02 13:43:34","distinguished":null,"edited":false,"id":"lq1a8yo","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":8,"stickied":false,"replies":[{"author":"u/EggIll7227","body":"Like all centralized projects (Swell, Maverick, EigenLayer, Etherfi, Blast/Blur), Orbiter *farmed us* and I assume that they will never launch a token, or if they do, that it will be worthless.\n\nzkSync was the last good airdrop. It won't happen again, because crypto isn't a serious industry, and virtually all \"founders\" are only here to get rich quick.","body_html":"<div class=\"md\"><p>Like all centralized projects (Swell, Maverick, EigenLayer, Etherfi, Blast/Blur), Orbiter <em>farmed us</em> and I assume that they will never launch a token, or if they do, that it will be worthless.</p>\n\n<p>zkSync was the last good airdrop. It won&#39;t happen again, because crypto isn&#39;t a serious industry, and virtually all &quot;founders&quot; are only here to get rich quick.</p>\n</div>","created_utc":"2024-10-02 15:56:48","distinguished":null,"edited":false,"id":"lq1wpmr","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1a8yo","score":6,"stickied":false,"replies":[{"author":"u/Stobie","body":"Everyone knows only serious industries hand out free money to people. And only people who aren't here to get rich quick complain projects aren't making them rich quick.","body_html":"<div class=\"md\"><p>Everyone knows only serious industries hand out free money to people. And only people who aren&#39;t here to get rich quick complain projects aren&#39;t making them rich quick.</p>\n</div>","created_utc":"2024-10-02 16:35:06","distinguished":null,"edited":false,"id":"lq22n1o","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1wpmr","score":4,"stickied":false,"replies":[]},{"author":"u/fecalreceptacle","body":"Damn... Thank you for the info","body_html":"<div class=\"md\"><p>Damn... Thank you for the info</p>\n</div>","created_utc":"2024-10-03 05:25:22","distinguished":null,"edited":false,"id":"lq4jup9","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1wpmr","score":2,"stickied":false,"replies":[]}]},{"author":"u/Tricky_Troll","body":"I just can't believe how scammyt the website looks now. When they just had a simple points system it was really premium feeling. Now that they've got a million sponsored quests and pop up QR codes and all sorts of random shit it feels like a cheap freemium app now. They really dropped the ball on their branding. I'd probably still be trying to farm points if they didn't drop the ball on their UX/UI.","body_html":"<div class=\"md\"><p>I just can&#39;t believe how scammyt the website looks now. When they just had a simple points system it was really premium feeling. Now that they&#39;ve got a million sponsored quests and pop up QR codes and all sorts of random shit it feels like a cheap freemium app now. They really dropped the ball on their branding. I&#39;d probably still be trying to farm points if they didn&#39;t drop the ball on their UX/UI.</p>\n</div>","created_utc":"2024-10-02 18:05:41","distinguished":null,"edited":false,"id":"lq2gx0i","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1a8yo","score":3,"stickied":false,"replies":[{"author":"u/fecalreceptacle","body":"So glad I gave up on those 'quests'. Still did way more than I should have","body_html":"<div class=\"md\"><p>So glad I gave up on those &#39;quests&#39;. Still did way more than I should have</p>\n</div>","created_utc":"2024-10-03 05:28:13","distinguished":null,"edited":false,"id":"lq4k8nv","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq2gx0i","score":2,"stickied":false,"replies":[]}]}]},{"author":"u/timwithnotoolbelt","body":"Im finally breaking up with Metamask. Hit some sort of wall where it simply stopped letting me send any tx and I had to import my HW wallet to Rabby. There’s no going back now. How is it still such garbage. God I wasted a lot of time with that shit app.","body_html":"<div class=\"md\"><p>Im finally breaking up with Metamask. Hit some sort of wall where it simply stopped letting me send any tx and I had to import my HW wallet to Rabby. There’s no going back now. How is it still such garbage. God I wasted a lot of time with that shit app.</p>\n</div>","created_utc":"2024-10-01 23:00:35","distinguished":null,"edited":false,"id":"lpxqiae","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":20,"stickied":false,"replies":[{"author":"u/LavoP","body":"Rabby is 1000x better. Been using that and Rainbow extension. It’s crazy how neither of the apps are still stellar UX wise.","body_html":"<div class=\"md\"><p>Rabby is 1000x better. Been using that and Rainbow extension. It’s crazy how neither of the apps are still stellar UX wise.</p>\n</div>","created_utc":"2024-10-01 23:06:03","distinguished":null,"edited":false,"id":"lpxr11e","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpxqiae","score":14,"stickied":false,"replies":[]},{"author":"u/Tricky_Troll","body":"I was actually finding myself impressed with how much MetaMask has improved lately. The wallet connection is much more smooth, as is changing networks and the automatic token detection. Metamask is so much smoother UX wise for me than it was a couple of years back when I moved to using Frame as my main driver.","body_html":"<div class=\"md\"><p>I was actually finding myself impressed with how much MetaMask has improved lately. The wallet connection is much more smooth, as is changing networks and the automatic token detection. Metamask is so much smoother UX wise for me than it was a couple of years back when I moved to using Frame as my main driver.</p>\n</div>","created_utc":"2024-10-02 03:58:51","distinguished":null,"edited":false,"id":"lpyh46h","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpxqiae","score":8,"stickied":false,"replies":[{"author":"u/Stobie","body":"Have you used rabby? Hard to use anything else which doesn't give such easy summary of tx simulation result. No effort protection against dns hijack is too valuable. Also has lots of good warnings like if you've never interacted with contract before or unexpected params which look dangerous like output address not sender. Even works with intents it can't simulate","body_html":"<div class=\"md\"><p>Have you used rabby? Hard to use anything else which doesn&#39;t give such easy summary of tx simulation result. No effort protection against dns hijack is too valuable. Also has lots of good warnings like if you&#39;ve never interacted with contract before or unexpected params which look dangerous like output address not sender. Even works with intents it can&#39;t simulate</p>\n</div>","created_utc":"2024-10-02 16:58:10","distinguished":null,"edited":false,"id":"lq26aih","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpyh46h","score":1,"stickied":false,"replies":[{"author":"u/Tricky_Troll","body":"> Have you used rabby?\n\nNo. I have a no tolerance for web 2 data mining policies in web 3, especially for a browser extension which can view all of my tabs and browser history etc. I refuse to support a web 2 style company in web 3 because it goes against Ethereum's values.\n\nIt could be the best fucking wallet around by a factor of 10 UX wise and I still won't use it on those grounds. Plus having your personal data linked to your finances is a bad idea. If Rabby had a data breach that would be a really big liability for all Rabby users. Depending on what they collect, (which is a lot) it could actually be really fucking bad. But that's getting into speculative territory. Maybe u/fecalreceptacle could do a privacy deep dive into Rabby for us.\n\nNeither MetaMask nor Frame collect any personally identifiable data and anonymous data can be opted out of.","body_html":"<div class=\"md\"><blockquote>\n<p>Have you used rabby?</p>\n</blockquote>\n\n<p>No. I have a no tolerance for web 2 data mining policies in web 3, especially for a browser extension which can view all of my tabs and browser history etc. I refuse to support a web 2 style company in web 3 because it goes against Ethereum&#39;s values.</p>\n\n<p>It could be the best fucking wallet around by a factor of 10 UX wise and I still won&#39;t use it on those grounds. Plus having your personal data linked to your finances is a bad idea. If Rabby had a data breach that would be a really big liability for all Rabby users. Depending on what they collect, (which is a lot) it could actually be really fucking bad. But that&#39;s getting into speculative territory. Maybe <a href=\"/u/fecalreceptacle\">u/fecalreceptacle</a> could do a privacy deep dive into Rabby for us.</p>\n\n<p>Neither MetaMask nor Frame collect any personally identifiable data and anonymous data can be opted out of.</p>\n</div>","created_utc":"2024-10-02 17:18:29","distinguished":null,"edited":false,"id":"lq29gsc","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq26aih","score":3,"stickied":false,"replies":[{"author":"u/Stobie","body":"Run it in an environment dedicated to using dapps only, with manual control of versions updating, then the safety features are worth it IMO. Should really do that anyway, at least just a dedicated brave browser profile if not a VM. DNS hijacks are too frequent and manually analysing all UI generated tx data every time doesn't seem viable if you're doing 10s a day. Last time I checked if you use metamask the infura/alchemy endpoints will know the link between your ip and wallets anyway.","body_html":"<div class=\"md\"><p>Run it in an environment dedicated to using dapps only, with manual control of versions updating, then the safety features are worth it IMO. Should really do that anyway, at least just a dedicated brave browser profile if not a VM. DNS hijacks are too frequent and manually analysing all UI generated tx data every time doesn&#39;t seem viable if you&#39;re doing 10s a day. Last time I checked if you use metamask the infura/alchemy endpoints will know the link between your ip and wallets anyway.</p>\n</div>","created_utc":"2024-10-02 17:39:36","distinguished":null,"edited":false,"id":"lq2crh1","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq29gsc","score":2,"stickied":false,"replies":[{"author":"u/Tricky_Troll","body":"Not really concerned about linking my IP since I use a VPN and different device for web 3. I would love to connect to my own node but people would then be able to connect my public wallet with my home node. Running a second node just for that simply isn't worth it.","body_html":"<div class=\"md\"><p>Not really concerned about linking my IP since I use a VPN and different device for web 3. I would love to connect to my own node but people would then be able to connect my public wallet with my home node. Running a second node just for that simply isn&#39;t worth it.</p>\n</div>","created_utc":"2024-10-02 18:02:40","distinguished":null,"edited":false,"id":"lq2gfi7","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq2crh1","score":2,"stickied":false,"replies":[]}]},{"author":"u/fecalreceptacle","body":"I might consider giving Rabby another look in the future. Got quite a lot going on recently. Thank you for the shout, Tricky!","body_html":"<div class=\"md\"><p>I might consider giving Rabby another look in the future. Got quite a lot going on recently. Thank you for the shout, Tricky!</p>\n</div>","created_utc":"2024-10-03 05:27:29","distinguished":null,"edited":false,"id":"lq4k52w","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq29gsc","score":2,"stickied":false,"replies":[]}]}]}]}]},{"author":"u/hanniabu","body":"EthStaker community call with Puffer is starting now.....feel free to drop questions in the chat!\n\n[https://www.youtube.com/watch?v=VrqOzi5JleQ](https://www.youtube.com/watch?v=VrqOzi5JleQ)","body_html":"<div class=\"md\"><p>EthStaker community call with Puffer is starting now.....feel free to drop questions in the chat!</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=VrqOzi5JleQ\">https://www.youtube.com/watch?v=VrqOzi5JleQ</a></p>\n</div>","created_utc":"2024-10-02 08:03:11","distinguished":null,"edited":false,"id":"lpzhuga","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":14,"stickied":false,"replies":[]},{"author":"u/ev1501","body":"anyone here buy base.eth names?  Is it worth it in your opinion? I guess they will only be valuable if Base L2 really takes off, even then its a maybe.","body_html":"<div class=\"md\"><p>anyone here buy base.eth names?  Is it worth it in your opinion? I guess they will only be valuable if Base L2 really takes off, even then its a maybe.</p>\n</div>","created_utc":"2024-10-02 13:32:22","distinguished":null,"edited":false,"id":"lq1837t","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":8,"stickied":false,"replies":[{"author":"u/danarchist","body":"Bought like 12. Got some fun ones like basedoteth.base.eth","body_html":"<div class=\"md\"><p>Bought like 12. Got some fun ones like basedoteth.base.eth</p>\n</div>","created_utc":"2024-10-02 20:37:12","distinguished":null,"edited":false,"id":"lq33d9m","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1837t","score":3,"stickied":false,"replies":[]},{"author":"u/Shitshotdead","body":"Considering base network metrics keep on reaching ATH, I'd say they got a lot of chance of taking off","body_html":"<div class=\"md\"><p>Considering base network metrics keep on reaching ATH, I&#39;d say they got a lot of chance of taking off</p>\n</div>","created_utc":"2024-10-02 17:12:08","distinguished":null,"edited":false,"id":"lq28hh7","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1837t","score":2,"stickied":false,"replies":[]},{"author":"u/cash","body":"a few for fun. why not, it's inexpensive. r:r is great","body_html":"<div class=\"md\"><p>a few for fun. why not, it&#39;s inexpensive. r:r is great</p>\n</div>","created_utc":"2024-10-02 18:56:45","distinguished":null,"edited":false,"id":"lq2p2aj","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1837t","score":1,"stickied":false,"replies":[]}]},{"author":"u/Worldsapart131","body":"Unfortunately I got that sub 2k, Rektober feeling. \n\nProve me wrong, crypto gods.","body_html":"<div class=\"md\"><p>Unfortunately I got that sub 2k, Rektober feeling. </p>\n\n<p>Prove me wrong, crypto gods.</p>\n</div>","created_utc":"2024-10-02 13:26:53","distinguished":null,"edited":false,"id":"lq1715q","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":13,"stickied":false,"replies":[{"author":"u/CoCleric","body":"If we go under 2K I’m gunna start buying again, just gotta find spare fiat to do that","body_html":"<div class=\"md\"><p>If we go under 2K I’m gunna start buying again, just gotta find spare fiat to do that</p>\n</div>","created_utc":"2024-10-02 13:42:51","distinguished":null,"edited":false,"id":"lq1a3yo","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1715q","score":11,"stickied":false,"replies":[]}]},{"author":"u/Jey_s_TeArS","body":">**Let there be wallets,** \n\n>**Fill them all with crazy bets,** \n\n>**On ramp no regrets.** \n\n\n~Daily haiku until we’re at least at 0.178 on the ETH/BTC ratio or highest market cap","body_html":"<div class=\"md\"><blockquote>\n<p><strong>Let there be wallets,</strong> </p>\n\n<p><strong>Fill them all with crazy bets,</strong> </p>\n\n<p><strong>On ramp no regrets.</strong> </p>\n</blockquote>\n\n<p>~Daily haiku until we’re at least at 0.178 on the ETH/BTC ratio or highest market cap</p>\n</div>","created_utc":"2024-10-02 14:46:54","distinguished":null,"edited":false,"id":"lq1m60k","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":12,"stickied":false,"replies":[]},{"author":"u/hedgemagus","body":"I’ve been all in on ETH since 2015 and I’ve never been more sick of it than now","body_html":"<div class=\"md\"><p>I’ve been all in on ETH since 2015 and I’ve never been more sick of it than now</p>\n</div>","created_utc":"2024-10-02 16:18:19","distinguished":null,"edited":false,"id":"lq1zzz0","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":25,"stickied":false,"replies":[{"author":"u/skinnbones22","body":"Every time I feel this way, I buy more. I've made money every time.","body_html":"<div class=\"md\"><p>Every time I feel this way, I buy more. I&#39;ve made money every time.</p>\n</div>","created_utc":"2024-10-02 19:37:51","distinguished":null,"edited":false,"id":"lq2v7x3","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1zzz0","score":7,"stickied":false,"replies":[]},{"author":"u/im_THIS_guy","body":"Really?  Worse than watching the price drop from $1400 to $80 and thinking that it's all over?  That you just got tuliped?","body_html":"<div class=\"md\"><p>Really?  Worse than watching the price drop from $1400 to $80 and thinking that it&#39;s all over?  That you just got tuliped?</p>\n</div>","created_utc":"2024-10-02 16:35:33","distinguished":null,"edited":false,"id":"lq22pkg","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1zzz0","score":11,"stickied":false,"replies":[{"author":"u/hedgemagus","body":"100%. At $90 I loaded up the most I ever had because I knew there was a huge future of milestones soon around the corner and adoption would take place if successful.\n\nWe hit all those milestones. Not much has changed in mass adoption in that time. There’s obviously still a roadmap and future but I haven’t had the same conviction about ETH in a long time.","body_html":"<div class=\"md\"><p>100%. At $90 I loaded up the most I ever had because I knew there was a huge future of milestones soon around the corner and adoption would take place if successful.</p>\n\n<p>We hit all those milestones. Not much has changed in mass adoption in that time. There’s obviously still a roadmap and future but I haven’t had the same conviction about ETH in a long time.</p>\n</div>","created_utc":"2024-10-02 16:42:50","distinguished":null,"edited":false,"id":"lq23uhx","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq22pkg","score":15,"stickied":false,"replies":[]},{"author":"u/setzer","body":"I don’t think it’s worse than the drop to 80 but this does seem worse than start of 2022’s drop due to lack of bounces primarily. Even then it rallied back to like 3500 after falling to 2100\n\nI’m not in the camp that thinks this will go lower, but if it does go sub 2k that will be quite brutal due to lack of bounce. And there are probably more folks underwater now than compared to back then given the starting point from last bear.","body_html":"<div class=\"md\"><p>I don’t think it’s worse than the drop to 80 but this does seem worse than start of 2022’s drop due to lack of bounces primarily. Even then it rallied back to like 3500 after falling to 2100</p>\n\n<p>I’m not in the camp that thinks this will go lower, but if it does go sub 2k that will be quite brutal due to lack of bounce. And there are probably more folks underwater now than compared to back then given the starting point from last bear.</p>\n</div>","created_utc":"2024-10-02 18:07:36","distinguished":null,"edited":"2024-10-02 18:12:43","id":"lq2h7yj","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq22pkg","score":3,"stickied":false,"replies":[]},{"author":"[deleted]","body":"[deleted]","body_html":"<div class=\"md\"><p>[deleted]</p>\n</div>","created_utc":"2024-10-02 19:18:32","distinguished":null,"edited":false,"id":"lq2sdjo","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq22pkg","score":1,"stickied":false,"replies":[{"author":"u/im_THIS_guy","body":"No, it was not an obvious buying opportunity. That's 20/20 vision talking.","body_html":"<div class=\"md\"><p>No, it was not an obvious buying opportunity. That&#39;s 20/20 vision talking.</p>\n</div>","created_utc":"2024-10-02 19:52:18","distinguished":null,"edited":false,"id":"lq2xa85","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq2sdjo","score":9,"stickied":false,"replies":[{"author":"[deleted]","body":"[deleted]","body_html":"<div class=\"md\"><p>[deleted]</p>\n</div>","created_utc":"2024-10-02 20:22:55","distinguished":null,"edited":false,"id":"lq31h02","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq2xa85","score":2,"stickied":false,"replies":[{"author":"u/im_THIS_guy","body":"TX id or it didn't happen.","body_html":"<div class=\"md\"><p>TX id or it didn&#39;t happen.</p>\n</div>","created_utc":"2024-10-02 21:03:52","distinguished":null,"edited":false,"id":"lq36o39","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq31h02","score":2,"stickied":false,"replies":[{"author":"u/definoob01","body":"Nice try, IRS! (jokes btw)","body_html":"<div class=\"md\"><p>Nice try, IRS! (jokes btw)</p>\n</div>","created_utc":"2024-10-03 01:41:38","distinguished":null,"edited":false,"id":"lq3wsyv","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq36o39","score":2,"stickied":false,"replies":[]}]},{"author":"u/setzer","body":"The initial drop to 80 was but I remember a lot of people ended up getting shaken out during the Covid plunge when it went from almost 300 to 90. It was  a pretty obvious buy at 80 yes but many did not have the conviction to hold through that later drop.","body_html":"<div class=\"md\"><p>The initial drop to 80 was but I remember a lot of people ended up getting shaken out during the Covid plunge when it went from almost 300 to 90. It was  a pretty obvious buy at 80 yes but many did not have the conviction to hold through that later drop.</p>\n</div>","created_utc":"2024-10-02 22:33:35","distinguished":null,"edited":false,"id":"lq3gfp7","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq31h02","score":2,"stickied":false,"replies":[]},{"author":"u/etherbie","body":"Bro. Buying $5 worth of ETH doesn’t count","body_html":"<div class=\"md\"><p>Bro. Buying $5 worth of ETH doesn’t count</p>\n</div>","created_utc":"2024-10-03 03:00:11","distinguished":null,"edited":false,"id":"lq43g7y","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq31h02","score":1,"stickied":false,"replies":[]}]}]}]}]},{"author":"u/hanniabu","body":"r/ethwhinance","body_html":"<div class=\"md\"><p><a href=\"/r/ethwhinance\">r/ethwhinance</a></p>\n</div>","created_utc":"2024-10-02 17:12:02","distinguished":null,"edited":false,"id":"lq28gzj","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1zzz0","score":14,"stickied":false,"replies":[{"author":"u/hedgemagus","body":"I’ve been positive for years man. This is a bit much to deal with anymore. Eventually Ethereum needs adoption and mass appeal instead of just talking about it. We are slowly bleeding out otherwise","body_html":"<div class=\"md\"><p>I’ve been positive for years man. This is a bit much to deal with anymore. Eventually Ethereum needs adoption and mass appeal instead of just talking about it. We are slowly bleeding out otherwise</p>\n</div>","created_utc":"2024-10-02 17:17:28","distinguished":null,"edited":false,"id":"lq29b5s","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq28gzj","score":13,"stickied":false,"replies":[{"author":"u/hanniabu","body":"Plenty of adoption happening\n\n[https://ethereum-adoption.netlify.app/](https://ethereum-adoption.netlify.app/)","body_html":"<div class=\"md\"><p>Plenty of adoption happening</p>\n\n<p><a href=\"https://ethereum-adoption.netlify.app/\">https://ethereum-adoption.netlify.app/</a></p>\n</div>","created_utc":"2024-10-02 18:54:00","distinguished":null,"edited":false,"id":"lq2omxd","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq29b5s","score":8,"stickied":false,"replies":[{"author":"u/dentonnn","body":"this is damn nice, bookmarked","body_html":"<div class=\"md\"><p>this is damn nice, bookmarked</p>\n</div>","created_utc":"2024-10-02 21:16:04","distinguished":null,"edited":false,"id":"lq3843c","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq2omxd","score":2,"stickied":false,"replies":[]}]},{"author":"u/Alatarlhun","body":"If I might suggest it, something in your life may have changed since 2015 which suggests your risk tolerance may need some tweaks.  \n\nI might also suggest this is near max shake out territory while still being in a clear upward trend which is why I think a crypto vet like yourself would *normally* be more steeled against such price shithousery at this stage in the cycle.","body_html":"<div class=\"md\"><p>If I might suggest it, something in your life may have changed since 2015 which suggests your risk tolerance may need some tweaks.  </p>\n\n<p>I might also suggest this is near max shake out territory while still being in a clear upward trend which is why I think a crypto vet like yourself would <em>normally</em> be more steeled against such price shithousery at this stage in the cycle.</p>\n</div>","created_utc":"2024-10-02 17:25:44","distinguished":null,"edited":false,"id":"lq2alhb","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq29b5s","score":3,"stickied":false,"replies":[{"author":"u/hedgemagus","body":"It hasn’t. I’m more financially flexible than ever. It’s just fucking exhausting to see nothing move this asset but downwards. I understand I’m whining. It honestly has felt justified at this point\n\nI don’t have any idea if this is a shake out and good times are ahead. I’ve been exactly wrong about that several times in a row now. US treasury bonds beat this fuckin asset class in the last year or so. With nothing but “good news” around ethereum the entire way.","body_html":"<div class=\"md\"><p>It hasn’t. I’m more financially flexible than ever. It’s just fucking exhausting to see nothing move this asset but downwards. I understand I’m whining. It honestly has felt justified at this point</p>\n\n<p>I don’t have any idea if this is a shake out and good times are ahead. I’ve been exactly wrong about that several times in a row now. US treasury bonds beat this fuckin asset class in the last year or so. With nothing but “good news” around ethereum the entire way.</p>\n</div>","created_utc":"2024-10-02 18:01:55","distinguished":null,"edited":"2024-10-02 18:05:14","id":"lq2gbbv","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq2alhb","score":12,"stickied":false,"replies":[{"author":"u/hanniabu","body":">I don’t have any idea if this is a shake out and good times are ahead\n\nzoom out, it's pretty clear we're at the end of accumulation and beginning the disbelief phase\n\n>US treasury bonds beat this fuckin asset class in the last year or so\n\nThat's purely false\n\nPrice today: $2400\n\nPrice 1 year ago: $1648\n\nThat's a 45% increase. I've heard others saying this \"bonds outperformed ETH\" narrative on Twitter before. It's all false meant to sow doubt and discontent. Always verify what you read.","body_html":"<div class=\"md\"><blockquote>\n<p>I don’t have any idea if this is a shake out and good times are ahead</p>\n</blockquote>\n\n<p>zoom out, it&#39;s pretty clear we&#39;re at the end of accumulation and beginning the disbelief phase</p>\n\n<blockquote>\n<p>US treasury bonds beat this fuckin asset class in the last year or so</p>\n</blockquote>\n\n<p>That&#39;s purely false</p>\n\n<p>Price today: $2400</p>\n\n<p>Price 1 year ago: $1648</p>\n\n<p>That&#39;s a 45% increase. I&#39;ve heard others saying this &quot;bonds outperformed ETH&quot; narrative on Twitter before. It&#39;s all false meant to sow doubt and discontent. Always verify what you read.</p>\n</div>","created_utc":"2024-10-02 18:58:02","distinguished":null,"edited":"2024-10-02 19:54:56","id":"lq2p9he","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq2gbbv","score":1,"stickied":false,"replies":[{"author":"u/hedgemagus","body":"And 2 years ago today it was 3400. The “zoom out” shit means nothing to me anymore lol. I’ve been in this long enough. Ethereum is arriving at a point where it has to actually show why it’s valuable to the masses or I don’t see why anything but a slow bleed isn’t the foreseeable future. It’s tiring.\n\nLike genuinely help me understand what makes you know this is the end of an “accumulation phase” besides hope?","body_html":"<div class=\"md\"><p>And 2 years ago today it was 3400. The “zoom out” shit means nothing to me anymore lol. I’ve been in this long enough. Ethereum is arriving at a point where it has to actually show why it’s valuable to the masses or I don’t see why anything but a slow bleed isn’t the foreseeable future. It’s tiring.</p>\n\n<p>Like genuinely help me understand what makes you know this is the end of an “accumulation phase” besides hope?</p>\n</div>","created_utc":"2024-10-02 19:08:06","distinguished":null,"edited":false,"id":"lq2qt06","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq2p9he","score":7,"stickied":false,"replies":[{"author":"u/hanniabu","body":"> And 2 years ago today it was 3400\n\nYou picked the period, not me. If you keep going back yes it gets higher, but then it'll get lower as you get into the previous bear market. This whole argument is pointless.\n\n> Like genuinely help me understand what makes you know this is the end of an “accumulation phase” besides hope?\n\nliquidity cycles, market cycle pattern......we've had the capitulation dip more than 2 years ago, 1.5 years of accumulation, and higher lows every step of the way\n\nThere's a reason this is called the depression phase, it's time-base capitulation","body_html":"<div class=\"md\"><blockquote>\n<p>And 2 years ago today it was 3400</p>\n</blockquote>\n\n<p>You picked the period, not me. If you keep going back yes it gets higher, but then it&#39;ll get lower as you get into the previous bear market. This whole argument is pointless.</p>\n\n<blockquote>\n<p>Like genuinely help me understand what makes you know this is the end of an “accumulation phase” besides hope?</p>\n</blockquote>\n\n<p>liquidity cycles, market cycle pattern......we&#39;ve had the capitulation dip more than 2 years ago, 1.5 years of accumulation, and higher lows every step of the way</p>\n\n<p>There&#39;s a reason this is called the depression phase, it&#39;s time-base capitulation</p>\n</div>","created_utc":"2024-10-02 20:15:02","distinguished":null,"edited":false,"id":"lq30evy","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq2qt06","score":6,"stickied":false,"replies":[{"author":"[deleted]","body":"[deleted]","body_html":"<div class=\"md\"><p>[deleted]</p>\n</div>","created_utc":"2024-10-02 20:38:13","distinguished":null,"edited":false,"id":"lq33i3w","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq30evy","score":3,"stickied":false,"replies":[{"author":"u/hanniabu","body":"> People were calling capitulation months ago.\n\n\nWell that's dumb because capitulation happened in 2022 when eth hit $880 and a month ago the price was multiples of that","body_html":"<div class=\"md\"><blockquote>\n<p> People were calling capitulation months ago.</p>\n</blockquote>\n\n<p>Well that&#39;s dumb because capitulation happened in 2022 when eth hit $880 and a month ago the price was multiples of that</p>\n</div>","created_utc":"2024-10-02 21:36:39","distinguished":null,"edited":false,"id":"lq3agm2","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq33i3w","score":3,"stickied":false,"replies":[]}]},{"author":"u/hedgemagus","body":"I mean this as respectfully as I can you don’t know what you’re talking about. There is not a cycle that’s running through a predetermined oscillation right now. I am positive you did not have a feel for where ETH would be today from even just a few months ago. I mean the world is in unprecedented times for a bunch of different reasons to begin with.\n\nI just want something to say “hey this is why I invested in this product. This is why ETH will be adopted” and I struggle to see anything resembling that anymore. We simply hope for the price to rise because it’s what we want","body_html":"<div class=\"md\"><p>I mean this as respectfully as I can you don’t know what you’re talking about. There is not a cycle that’s running through a predetermined oscillation right now. I am positive you did not have a feel for where ETH would be today from even just a few months ago. I mean the world is in unprecedented times for a bunch of different reasons to begin with.</p>\n\n<p>I just want something to say “hey this is why I invested in this product. This is why ETH will be adopted” and I struggle to see anything resembling that anymore. We simply hope for the price to rise because it’s what we want</p>\n</div>","created_utc":"2024-10-02 20:46:17","distinguished":null,"edited":false,"id":"lq34iw6","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq30evy","score":4,"stickied":false,"replies":[{"author":"u/hanniabu","body":"> There is not a cycle that’s running through a predetermined oscillation right now\n\n\nGlobal liquidity cycles are 100% a real thing, you can look it up. Psychological market cycle is a really thing, you can look this up to.\n\n\n> and I struggle to see anything resembling that anymore.\n\n\nIf that's truly what you believe then it's probably best for your mental health to reinvest your funds elsewhere. \n\n\nI see development, I see innovation, I see network effects, I see adoption, I see plenty of promise","body_html":"<div class=\"md\"><blockquote>\n<p> There is not a cycle that’s running through a predetermined oscillation right now</p>\n</blockquote>\n\n<p>Global liquidity cycles are 100% a real thing, you can look it up. Psychological market cycle is a really thing, you can look this up to.</p>\n\n<blockquote>\n<p> and I struggle to see anything resembling that anymore.</p>\n</blockquote>\n\n<p>If that&#39;s truly what you believe then it&#39;s probably best for your mental health to reinvest your funds elsewhere. </p>\n\n<p>I see development, I see innovation, I see network effects, I see adoption, I see plenty of promise</p>\n</div>","created_utc":"2024-10-02 21:43:09","distinguished":null,"edited":false,"id":"lq3b68r","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq34iw6","score":3,"stickied":false,"replies":[{"author":"u/hedgemagus","body":"What’s the adoption you see?","body_html":"<div class=\"md\"><p>What’s the adoption you see?</p>\n</div>","created_utc":"2024-10-02 21:51:45","distinguished":null,"edited":false,"id":"lq3c49w","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq3b68r","score":1,"stickied":false,"replies":[]}]}]}]}]}]}]}]}]}]},{"author":"u/Stobie","body":"Probably time of cycles to long harder then. Reality is ethereum is doing better than ever.","body_html":"<div class=\"md\"><p>Probably time of cycles to long harder then. Reality is ethereum is doing better than ever.</p>\n</div>","created_utc":"2024-10-02 16:33:10","distinguished":null,"edited":false,"id":"lq22c76","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1zzz0","score":4,"stickied":false,"replies":[{"author":"u/hedgemagus","body":"If ethereum was doing better than ever it would not be circling sub 2k while bitcoin is at 60k. This sentence would have horrified people a few years ago","body_html":"<div class=\"md\"><p>If ethereum was doing better than ever it would not be circling sub 2k while bitcoin is at 60k. This sentence would have horrified people a few years ago</p>\n</div>","created_utc":"2024-10-02 16:44:18","distinguished":null,"edited":false,"id":"lq242vp","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq22c76","score":7,"stickied":false,"replies":[{"author":"u/Bob-Rossi","body":"Comparing the BTC vs ETH ETF numbers has been really sobering for me the last 3 months. I’m probably focusing on it too much, but it feels like one of the few quantitative ways to analyze “tradfi” demand. The data is ugly and it’s hard to get excited for anything ratio related because of it. I don’t blame anyone who is feeling frustrated.","body_html":"<div class=\"md\"><p>Comparing the BTC vs ETH ETF numbers has been really sobering for me the last 3 months. I’m probably focusing on it too much, but it feels like one of the few quantitative ways to analyze “tradfi” demand. The data is ugly and it’s hard to get excited for anything ratio related because of it. I don’t blame anyone who is feeling frustrated.</p>\n</div>","created_utc":"2024-10-02 19:55:36","distinguished":null,"edited":false,"id":"lq2xqux","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq242vp","score":9,"stickied":false,"replies":[]},{"author":"u/Alatarlhun","body":"10 out of 10 people know about bitcoin even if they know nothing else about crypto.  Ethereum doesn't yet have that luxury.","body_html":"<div class=\"md\"><p>10 out of 10 people know about bitcoin even if they know nothing else about crypto.  Ethereum doesn&#39;t yet have that luxury.</p>\n</div>","created_utc":"2024-10-02 17:30:40","distinguished":null,"edited":false,"id":"lq2bd2e","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq242vp","score":6,"stickied":false,"replies":[{"author":"u/hedgemagus","body":"But how long can you hold out and say it will happen? It’s not guaranteed to happen. That’s where my head is at lately. Eventually ETH has to be mass adopted or it fails. It doesn’t seem much closer than it was 5 years ago","body_html":"<div class=\"md\"><p>But how long can you hold out and say it will happen? It’s not guaranteed to happen. That’s where my head is at lately. Eventually ETH has to be mass adopted or it fails. It doesn’t seem much closer than it was 5 years ago</p>\n</div>","created_utc":"2024-10-02 18:03:13","distinguished":null,"edited":false,"id":"lq2gius","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq2bd2e","score":4,"stickied":false,"replies":[{"author":"u/Alatarlhun","body":"Yes, mass adoption or fail.  And yes, I  agree there is no reason for mass adoption \"soon\".  \n\nIf you can't think it years, there are plenty of other asset and classes out there.","body_html":"<div class=\"md\"><p>Yes, mass adoption or fail.  And yes, I  agree there is no reason for mass adoption &quot;soon&quot;.  </p>\n\n<p>If you can&#39;t think it years, there are plenty of other asset and classes out there.</p>\n</div>","created_utc":"2024-10-02 20:23:03","distinguished":null,"edited":false,"id":"lq31hps","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq2gius","score":1,"stickied":false,"replies":[{"author":"u/hedgemagus","body":"Brother I hear you but I’ve been thinking in years for years now. It wears on you after a while","body_html":"<div class=\"md\"><p>Brother I hear you but I’ve been thinking in years for years now. It wears on you after a while</p>\n</div>","created_utc":"2024-10-02 20:47:48","distinguished":null,"edited":false,"id":"lq34pp8","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq31hps","score":3,"stickied":false,"replies":[{"author":"u/Bob-Rossi","body":"One more rant and I’ll leave you alone lol, but +1 on this. I keep hearing responses like “think long term / think in years / this will take time”. We have! It’s a 10 year old technology at this point… and that’s still young in many ways…  but for a lot of people around in 15/16/17 it’s been a long time.","body_html":"<div class=\"md\"><p>One more rant and I’ll leave you alone lol, but +1 on this. I keep hearing responses like “think long term / think in years / this will take time”. We have! It’s a 10 year old technology at this point… and that’s still young in many ways…  but for a lot of people around in 15/16/17 it’s been a long time.</p>\n</div>","created_utc":"2024-10-03 04:14:30","distinguished":null,"edited":false,"id":"lq4av8k","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq34pp8","score":3,"stickied":false,"replies":[{"author":"u/Alatarlhun","body":"Sorry no one can promise you a 80 to 4000 run any time soon.  Instead of feeling lucky that is what you caught and should have made life changing money, you are here to demoralize the rest of us who have nothing near those expectations.","body_html":"<div class=\"md\"><p>Sorry no one can promise you a 80 to 4000 run any time soon.  Instead of feeling lucky that is what you caught and should have made life changing money, you are here to demoralize the rest of us who have nothing near those expectations.</p>\n</div>","created_utc":"2024-10-03 05:31:23","distinguished":null,"edited":false,"id":"lq4kohc","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq4av8k","score":1,"stickied":false,"replies":[{"author":"u/Bob-Rossi","body":"OP is feeling down, and as such I’m (trying to) sympathize with them. Just trying to be human. \n\nThe last 3 months (probably more tbh) I’ve been sharing negative sentiment. I‘ve generally tried to do so in a way that is either backed up by quantitative data or is in the context of something like this where I try to sympathize & validate others in the same boat. I’ve basically never done so in a trolly, 3 sentence emotional vomit of anger… nor have I tried to do so to manipulate people - like certain “we’re gonna hit $2,500 because I have a long open” posts. \n\nAnd regardless, idk what you want me to do. I’m not just going to come on here and lie all day. I’m disappointed where the space is at and I’m communicating that. I’m not going to lie to people, especially a group I’ve “known” for like 8 years now. \n\nI had this discussion with someone a few months ago. Called me out (somewhat fairly), I tried to rein it in a little better but apparently no matter how many eggshells I tiptoe around anytime I post something negative I gotta get accused of being an asshole. As again, I’m not going to just stop being honest to people.","body_html":"<div class=\"md\"><p>OP is feeling down, and as such I’m (trying to) sympathize with them. Just trying to be human. </p>\n\n<p>The last 3 months (probably more tbh) I’ve been sharing negative sentiment. I‘ve generally tried to do so in a way that is either backed up by quantitative data or is in the context of something like this where I try to sympathize &amp; validate others in the same boat. I’ve basically never done so in a trolly, 3 sentence emotional vomit of anger… nor have I tried to do so to manipulate people - like certain “we’re gonna hit $2,500 because I have a long open” posts. </p>\n\n<p>And regardless, idk what you want me to do. I’m not just going to come on here and lie all day. I’m disappointed where the space is at and I’m communicating that. I’m not going to lie to people, especially a group I’ve “known” for like 8 years now. </p>\n\n<p>I had this discussion with someone a few months ago. Called me out (somewhat fairly), I tried to rein it in a little better but apparently no matter how many eggshells I tiptoe around anytime I post something negative I gotta get accused of being an asshole. As again, I’m not going to just stop being honest to people.</p>\n</div>","created_utc":"2024-10-03 05:50:38","distinguished":null,"edited":false,"id":"lq4nhn3","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq4kohc","score":4,"stickied":false,"replies":[{"author":"u/hedgemagus","body":"Thank you for being a human. I understand I'm whining, but really if I was less emotional in my writing I would be trying to pose the same questions you've put here. What positive outlook do people have anymore? Im failing to see it with ETH at this point.\n\nIts a totally fair question with no agenda associated (im not some weirdo maxi of another coin.) The fact that people dont even like to hear it be asked makes me question things even further","body_html":"<div class=\"md\"><p>Thank you for being a human. I understand I&#39;m whining, but really if I was less emotional in my writing I would be trying to pose the same questions you&#39;ve put here. What positive outlook do people have anymore? Im failing to see it with ETH at this point.</p>\n\n<p>Its a totally fair question with no agenda associated (im not some weirdo maxi of another coin.) The fact that people dont even like to hear it be asked makes me question things even further</p>\n</div>","created_utc":"2024-10-03 07:27:03","distinguished":null,"edited":false,"id":"lq549wr","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq4nhn3","score":2,"stickied":false,"replies":[{"author":"u/Bob-Rossi","body":"The sub (and yes, this includes the past versions of myself…) is pretty sensitive to negative sentiment because there is a history of BTC maxis / buttcoiners / generic internet trolls who come here to dance on graves essentially. So I get it as its created a situation where being “negative” involved a lot more substance tied to it to not just get downvoted. \n\nIt’s a fair question. I think a lot of people have valid reasons to be excited. I also think there are reasons to be concerned. It’s tricky. I guess to answer your question - long term i remain cautiously optimistic as I think the better tech and the large share of community activity and developer activity will win out. But as I noted before I’ve completely underestimated the narrative strength Bitcoin has. I would have absolutely said we’d flip by EoY 2024 if asked at really any point up until maybe a year ago.","body_html":"<div class=\"md\"><p>The sub (and yes, this includes the past versions of myself…) is pretty sensitive to negative sentiment because there is a history of BTC maxis / buttcoiners / generic internet trolls who come here to dance on graves essentially. So I get it as its created a situation where being “negative” involved a lot more substance tied to it to not just get downvoted. </p>\n\n<p>It’s a fair question. I think a lot of people have valid reasons to be excited. I also think there are reasons to be concerned. It’s tricky. I guess to answer your question - long term i remain cautiously optimistic as I think the better tech and the large share of community activity and developer activity will win out. But as I noted before I’ve completely underestimated the narrative strength Bitcoin has. I would have absolutely said we’d flip by EoY 2024 if asked at really any point up until maybe a year ago.</p>\n</div>","created_utc":"2024-10-03 07:57:05","distinguished":null,"edited":false,"id":"lq5aaue","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq549wr","score":2,"stickied":false,"replies":[{"author":"u/hedgemagus","body":"I would just want it to be clear I'm not a maxi or a troll, ive been a genuine fan of this community and space for a long time. I came here when it split from ETHtrader. I'm just not comfortable with how many people genuinely ignore any kind of negative sentiment when all this alleged positive sentiment in the last year has done just about nothing for the price.\n\nI appreciate your answer the most. It is important to stay realistic about investments. Hopefully a turnaround of the global economy can bring us out of this hellhole","body_html":"<div class=\"md\"><p>I would just want it to be clear I&#39;m not a maxi or a troll, ive been a genuine fan of this community and space for a long time. I came here when it split from ETHtrader. I&#39;m just not comfortable with how many people genuinely ignore any kind of negative sentiment when all this alleged positive sentiment in the last year has done just about nothing for the price.</p>\n\n<p>I appreciate your answer the most. It is important to stay realistic about investments. Hopefully a turnaround of the global economy can bring us out of this hellhole</p>\n</div>","created_utc":"2024-10-03 08:00:26","distinguished":null,"edited":false,"id":"lq5azg8","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq5aaue","score":2,"stickied":false,"replies":[{"author":"u/Bob-Rossi","body":"FWIW I don’t think you are being a troll. I’ll never be 100% accurate but I think you can usually tell when someone is just riling up the crowd sort of speak.","body_html":"<div class=\"md\"><p>FWIW I don’t think you are being a troll. I’ll never be 100% accurate but I think you can usually tell when someone is just riling up the crowd sort of speak.</p>\n</div>","created_utc":"2024-10-03 08:46:41","distinguished":null,"edited":false,"id":"lq5ki5q","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq5azg8","score":2,"stickied":false,"replies":[]}]}]}]},{"author":"u/Alatarlhun","body":"I am just saying if one is \"tired\" of holding an asset, they should consider not holding said asset instead of bemoaning about it on said asset's sub.  \n\nUnless there is something fundamentally broken with Ethereum, there is no reason for negative sentiment (pegged to normal crypto price fluctuations) just because mass adoption hasn't yet happened.","body_html":"<div class=\"md\"><p>I am just saying if one is &quot;tired&quot; of holding an asset, they should consider not holding said asset instead of bemoaning about it on said asset&#39;s sub.  </p>\n\n<p>Unless there is something fundamentally broken with Ethereum, there is no reason for negative sentiment (pegged to normal crypto price fluctuations) just because mass adoption hasn&#39;t yet happened.</p>\n</div>","created_utc":"2024-10-03 07:06:28","distinguished":null,"edited":false,"id":"lq50927","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq4nhn3","score":1,"stickied":false,"replies":[{"author":"u/hedgemagus","body":"Because mass adoption hasnt happened for THIS long is absolutely a reason for negative sentiment IMO. I've been in these threads longer than 90% of people here and the comments years ago treated 2024 and beyond as the complete flourishing of a fully fleshed out product. We're nowhere close to that.\n\nI'm not tired of holding an asset. I know people in this sub dont like criticism of ETH or questioning the product. But ask yourself why that is? Is it because you dont like thinking about it either?\n\nAll of the major milestones that I thought would cause mass adoption have come and gone. There is no one thing anyone is pointing to any longer that suggests \"once this goes live, the asset will really capitalize and take off.\" ETH bleeds harder than just about any other crypto. There are like a million reasons for negative sentiment to at least be *mentioned*","body_html":"<div class=\"md\"><p>Because mass adoption hasnt happened for THIS long is absolutely a reason for negative sentiment IMO. I&#39;ve been in these threads longer than 90% of people here and the comments years ago treated 2024 and beyond as the complete flourishing of a fully fleshed out product. We&#39;re nowhere close to that.</p>\n\n<p>I&#39;m not tired of holding an asset. I know people in this sub dont like criticism of ETH or questioning the product. But ask yourself why that is? Is it because you dont like thinking about it either?</p>\n\n<p>All of the major milestones that I thought would cause mass adoption have come and gone. There is no one thing anyone is pointing to any longer that suggests &quot;once this goes live, the asset will really capitalize and take off.&quot; ETH bleeds harder than just about any other crypto. There are like a million reasons for negative sentiment to at least be <em>mentioned</em></p>\n</div>","created_utc":"2024-10-03 07:24:51","distinguished":null,"edited":false,"id":"lq53u7v","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq50927","score":1,"stickied":false,"replies":[{"author":"u/Alatarlhun","body":"Yes, we are nowhere near close to mass adoption.  But if that is your singular metric, then why hold the asset?  I don't get it.  \n\n> I know people in this sub dont like criticism of ETH \n\nIs complaining about price really criticism of ETH the product?  I don't think I would agree.  \n\n>All of the major milestones that I thought would cause mass adoption have come and gone.\n\nI can't recall a single past milestone that where that would have been an objectively reasonable expectation.  The only ones on the roadmap today are account abstraction related which is a very hard problem to elegantly solve.","body_html":"<div class=\"md\"><p>Yes, we are nowhere near close to mass adoption.  But if that is your singular metric, then why hold the asset?  I don&#39;t get it.  </p>\n\n<blockquote>\n<p>I know people in this sub dont like criticism of ETH </p>\n</blockquote>\n\n<p>Is complaining about price really criticism of ETH the product?  I don&#39;t think I would agree.  </p>\n\n<blockquote>\n<p>All of the major milestones that I thought would cause mass adoption have come and gone.</p>\n</blockquote>\n\n<p>I can&#39;t recall a single past milestone that where that would have been an objectively reasonable expectation.  The only ones on the roadmap today are account abstraction related which is a very hard problem to elegantly solve.</p>\n</div>","created_utc":"2024-10-03 09:12:40","distinguished":null,"edited":false,"id":"lq5phrq","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq53u7v","score":1,"stickied":false,"replies":[{"author":"u/hedgemagus","body":"whether or not we are close to mass adoption is not the singular metric i have for holding it. I'm commenting on how in the 9 years ive been around ETH we have only marginally moved the needle towards adoption. I think thats an increasingly seriously problem this far into development. Eventually the money we seek to attract will no longer be interested if ETH continues to not really make waves.","body_html":"<div class=\"md\"><p>whether or not we are close to mass adoption is not the singular metric i have for holding it. I&#39;m commenting on how in the 9 years ive been around ETH we have only marginally moved the needle towards adoption. I think thats an increasingly seriously problem this far into development. Eventually the money we seek to attract will no longer be interested if ETH continues to not really make waves.</p>\n</div>","created_utc":"2024-10-03 09:14:35","distinguished":null,"edited":false,"id":"lq5pv0m","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq5phrq","score":1,"stickied":false,"replies":[{"author":"u/Alatarlhun","body":"While I don't disagree with that, every form of alternative money and defi has this problem.  ETH is still where virtually all the developer attention remains, including independent teams creating innovative dapps.  \n\nAgain, if I thought only marginal progress is being made, there are at least two dozen other assets I am would move my money into without concern for regret.","body_html":"<div class=\"md\"><p>While I don&#39;t disagree with that, every form of alternative money and defi has this problem.  ETH is still where virtually all the developer attention remains, including independent teams creating innovative dapps.  </p>\n\n<p>Again, if I thought only marginal progress is being made, there are at least two dozen other assets I am would move my money into without concern for regret.</p>\n</div>","created_utc":"2024-10-03 09:23:56","distinguished":null,"edited":false,"id":"lq5qlet","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq5pv0m","score":1,"stickied":false,"replies":[{"author":"u/hedgemagus","body":"all of these coins have this problem yet BTC and SOL dont seem to share the same downward trend nearly as often as ETH. Its super defeating to watch","body_html":"<div class=\"md\"><p>all of these coins have this problem yet BTC and SOL dont seem to share the same downward trend nearly as often as ETH. Its super defeating to watch</p>\n</div>","created_utc":"2024-10-03 09:25:05","distinguished":null,"edited":false,"id":"lq5qroj","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq5qlet","score":1,"stickied":false,"replies":[{"author":"u/Alatarlhun","body":"Then invest in BTC and SOL and don't look back.","body_html":"<div class=\"md\"><p>Then invest in BTC and SOL and don&#39;t look back.</p>\n</div>","created_utc":"2024-10-03 09:25:54","distinguished":null,"edited":false,"id":"lq5qw8h","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq5qroj","score":1,"stickied":false,"replies":[{"author":"u/hedgemagus","body":"just saying what youre suggesting everyone suffers from isnt true. I dont want to invest in those things. ETH has uniquely suffered from losses in a way others arent. Its puzzling","body_html":"<div class=\"md\"><p>just saying what youre suggesting everyone suffers from isnt true. I dont want to invest in those things. ETH has uniquely suffered from losses in a way others arent. Its puzzling</p>\n</div>","created_utc":"2024-10-03 09:30:12","distinguished":null,"edited":false,"id":"lq5rm3e","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq5qw8h","score":1,"stickied":false,"replies":[]}]}]}]}]}]}]},{"author":"u/Bob-Rossi","body":"If you were “just saying that” you would have said it. Instead you accused me of actively demoralizing the sub! Thats a different bar, because it implies I’m actively trying to ruin the day of people here. Which I’m not… \n\nI don’t even disagree btw, and if you go through my posts you’ll find instances where I’ve told people to sell if it’s causing this type of emotional. Part of what I was saying of being truthful - I’m not going to tell someone who’s struggling day to day with the price to keep holding if it’s affecting them emotionally. \n\nI do also feel the need to point out there are reasons to be here other than price action. Of course that is what’s triggers the majority of “complaints”, but there are ways Ethereum isn’t really there yet in terms of UX and/or application layer items. Which adds to the frustration, considering I think people were a lot more optimistic about where the state of the network would be now back then (if that makes sense). \n\nFor example again, I’ve complained about how hard it is to solo stake and that IMO is a fundamental flaw of Ethereum not tied to price. Despite being active in governance, I don’t think that has really been solved. And in terms of just doing things on the network “for fun”, if your not a DeFi nerd its kinda barren in terms of the app layer IMO.","body_html":"<div class=\"md\"><p>If you were “just saying that” you would have said it. Instead you accused me of actively demoralizing the sub! Thats a different bar, because it implies I’m actively trying to ruin the day of people here. Which I’m not… </p>\n\n<p>I don’t even disagree btw, and if you go through my posts you’ll find instances where I’ve told people to sell if it’s causing this type of emotional. Part of what I was saying of being truthful - I’m not going to tell someone who’s struggling day to day with the price to keep holding if it’s affecting them emotionally. </p>\n\n<p>I do also feel the need to point out there are reasons to be here other than price action. Of course that is what’s triggers the majority of “complaints”, but there are ways Ethereum isn’t really there yet in terms of UX and/or application layer items. Which adds to the frustration, considering I think people were a lot more optimistic about where the state of the network would be now back then (if that makes sense). </p>\n\n<p>For example again, I’ve complained about how hard it is to solo stake and that IMO is a fundamental flaw of Ethereum not tied to price. Despite being active in governance, I don’t think that has really been solved. And in terms of just doing things on the network “for fun”, if your not a DeFi nerd its kinda barren in terms of the app layer IMO.</p>\n</div>","created_utc":"2024-10-03 07:33:19","distinguished":null,"edited":false,"id":"lq55iyx","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq50927","score":1,"stickied":false,"replies":[{"author":"u/Alatarlhun","body":"You *are* demoralizing the sub over a criticism of price.  You just think you deserve an exception because you held longer than most.  \n\nI am not trying to be a jerk but I also don't think my perception of this behavior is unreasonable.  \n\n> I’ve complained about how hard it is to solo stake and that IMO is a fundamental flaw of Ethereum\n\nOk but was that on this thread?","body_html":"<div class=\"md\"><p>You <em>are</em> demoralizing the sub over a criticism of price.  You just think you deserve an exception because you held longer than most.  </p>\n\n<p>I am not trying to be a jerk but I also don&#39;t think my perception of this behavior is unreasonable.  </p>\n\n<blockquote>\n<p>I’ve complained about how hard it is to solo stake and that IMO is a fundamental flaw of Ethereum</p>\n</blockquote>\n\n<p>Ok but was that on this thread?</p>\n</div>","created_utc":"2024-10-03 09:18:23","distinguished":null,"edited":false,"id":"lq5qade","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq55iyx","score":1,"stickied":false,"replies":[{"author":"u/Bob-Rossi","body":"You brought up people need to think in years, idk how you expect me to organically pivot into staking from that. \n\nYour behavior is unreasonable. You get to bust in complaining that the complainers are too short sighted.  Thats totally fine even though it’s demoralizing to people like me. It’s a stupid double standard that you can just do a one sentence “adjust your timeframe” comment yet when I want to share some negative thoughts I have to bring a 20 slide PowerPoint to validate myself. \n\nI don’t fit your narrative (i.e. I actually have data points to back up my “complaining”) and now you got nothing but personal attacks. You’re being a jerk, seriously.","body_html":"<div class=\"md\"><p>You brought up people need to think in years, idk how you expect me to organically pivot into staking from that. </p>\n\n<p>Your behavior is unreasonable. You get to bust in complaining that the complainers are too short sighted.  Thats totally fine even though it’s demoralizing to people like me. It’s a stupid double standard that you can just do a one sentence “adjust your timeframe” comment yet when I want to share some negative thoughts I have to bring a 20 slide PowerPoint to validate myself. </p>\n\n<p>I don’t fit your narrative (i.e. I actually have data points to back up my “complaining”) and now you got nothing but personal attacks. You’re being a jerk, seriously.</p>\n</div>","created_utc":"2024-10-03 09:37:10","distinguished":null,"edited":false,"id":"lq5sulb","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq5qade","score":1,"stickied":false,"replies":[{"author":"u/Alatarlhun","body":"I am have no interest in continuing this conservation when you perceive yourself as a double victim (eth price, and being discouraged from complaining about ETH's price).  \n\nYou are welcome to criticism ETH as long as it isn't about price, but that takes work, or in your case a powerpoint.\n\nBut again, if ETH is so bad, you should sell.  Like seriously.  Make yourself happy, you seem to be a dark place and aren't living up to your namesake.","body_html":"<div class=\"md\"><p>I am have no interest in continuing this conservation when you perceive yourself as a double victim (eth price, and being discouraged from complaining about ETH&#39;s price).  </p>\n\n<p>You are welcome to criticism ETH as long as it isn&#39;t about price, but that takes work, or in your case a powerpoint.</p>\n\n<p>But again, if ETH is so bad, you should sell.  Like seriously.  Make yourself happy, you seem to be a dark place and aren&#39;t living up to your namesake.</p>\n</div>","created_utc":"2024-10-03 09:42:23","distinguished":null,"edited":false,"id":"lq5tsge","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq5sulb","score":1,"stickied":false,"replies":[{"author":"u/Bob-Rossi","body":"What is my “namesake”? I built my reputation on being honest with people and trying to give data driven analysis when possible. As well as contributing to network with projects were I could. I make a comment sympathizing with another user of the community that it’s difficult to hear “adjust your timeframe to years” when it’s already been 8 years of being in the space and then get accused of purposely demoralize a sub full of people I’ve “known” for nearly a decade? Bull\n\nDo you realize there’s people on this sub I’ve talked to that were about to commit suicide over this stuff? since then I’ve tried to do my best to sympathize with people who maybe just are having a bad hour / day / week / month and need to vent. On the flip side there’s people who’ve told me my advice on the grayscale ETH made them 100s of thousands of dollars… which is absolutely taking 0 credit other then it’s a realization that what I say matters. \n\nSo I can’t just, again, lie to people. As there are people taking actions over words said here. So I don’t get why I have to get accused of this while you got people like you know who who are just saying for 2 weeks that ETH will hit $2,500 because as we found out they were underwater on a long. Thats price talk is okay because it’s positive? Even though that’s far more manipulative than what I’m posting. \n\nLike I said earlier I’m not gonna sit here and lie to people because as I’ve told the other person months ago… part of what I feel my reputation has been built around is being honest and genuine with people. So to just back out of that now is going against my self. There’s a duty to be truthful, and I can’t just sit here and have people believe for example the ETH ETF is a huge success when metrics prove otherwise. Thats dangerous. \n\nWant another example? Everyone here loved to talk about how easy staking is yet my experience has been wasting $1000 on a NUC and probably 100+ hours of trying to learn how to do it. I mean check this disaster out - https://www.reddit.com/r/ethstaker/s/MzwAcvMzzC . So point there is that I’m not gonna sugarcoat something like staking if it makes someone else waste their money trying to do it.","body_html":"<div class=\"md\"><p>What is my “namesake”? I built my reputation on being honest with people and trying to give data driven analysis when possible. As well as contributing to network with projects were I could. I make a comment sympathizing with another user of the community that it’s difficult to hear “adjust your timeframe to years” when it’s already been 8 years of being in the space and then get accused of purposely demoralize a sub full of people I’ve “known” for nearly a decade? Bull</p>\n\n<p>Do you realize there’s people on this sub I’ve talked to that were about to commit suicide over this stuff? since then I’ve tried to do my best to sympathize with people who maybe just are having a bad hour / day / week / month and need to vent. On the flip side there’s people who’ve told me my advice on the grayscale ETH made them 100s of thousands of dollars… which is absolutely taking 0 credit other then it’s a realization that what I say matters. </p>\n\n<p>So I can’t just, again, lie to people. As there are people taking actions over words said here. So I don’t get why I have to get accused of this while you got people like you know who who are just saying for 2 weeks that ETH will hit $2,500 because as we found out they were underwater on a long. Thats price talk is okay because it’s positive? Even though that’s far more manipulative than what I’m posting. </p>\n\n<p>Like I said earlier I’m not gonna sit here and lie to people because as I’ve told the other person months ago… part of what I feel my reputation has been built around is being honest and genuine with people. So to just back out of that now is going against my self. There’s a duty to be truthful, and I can’t just sit here and have people believe for example the ETH ETF is a huge success when metrics prove otherwise. Thats dangerous. </p>\n\n<p>Want another example? Everyone here loved to talk about how easy staking is yet my experience has been wasting $1000 on a NUC and probably 100+ hours of trying to learn how to do it. I mean check this disaster out - <a href=\"https://www.reddit.com/r/ethstaker/s/MzwAcvMzzC\">https://www.reddit.com/r/ethstaker/s/MzwAcvMzzC</a> . So point there is that I’m not gonna sugarcoat something like staking if it makes someone else waste their money trying to do it.</p>\n</div>","created_utc":"2024-10-03 10:07:10","distinguished":null,"edited":false,"id":"lq5yf8s","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq5tsge","score":1,"stickied":false,"replies":[{"author":"u/Alatarlhun","body":">it’s difficult to hear “adjust your timeframe to years” when it’s already been 8 years of being in the space and then get accused of purposely demoralize a sub\n\nNo doubt. \n\n>Do you realize there’s people on this sub I’ve talked to that were about to commit suicide over this stuff?\n\nYou seem to be making my point for me.  If adjusting to ETH's (arguably) disappointing reality is this difficult--don't.  Rather, do what you need to make yourself happy.  Coming here to make other people as miserable as you is not the answer. \n\n>So I can’t just, again, lie to people.\n\nNo one is asking you to lie.  Not complaining about price isn't lying.  \n\n>people like you know who who are just saying for 2 weeks that ETH will hit $2,500 because as we found out they were underwater on a long. \n\nI assume you don't mean me specifically because that absolutely didn't happen.\n\n>Thats price talk is okay because it’s positive?\n\nI make it a point to downvote inane positive price talk.  I also make it a point to consider downside targets when looking at TA.  I can back this up with evidence if it matters, but we both know it doesn't.  \n\n>I can’t just sit here and have people believe for example the ETH ETF is a huge success when metrics prove otherwise\n\nThis depends on your measure of success.  Success to me was approval of the ETF; the inflows in the short and medium term are almost entirely irrelevant to the long term thesis.  \n\n>Everyone here loved to talk about how easy staking is yet my experience has been wasting $1000 on a NUC and probably 100+ hours of trying to learn how to do it.\n\nOh, I agree with this.  I also opposed the endless spam hyping RPL that was prevalent here for years when it was an obvious money grab by the team and early adopters.","body_html":"<div class=\"md\"><blockquote>\n<p>it’s difficult to hear “adjust your timeframe to years” when it’s already been 8 years of being in the space and then get accused of purposely demoralize a sub</p>\n</blockquote>\n\n<p>No doubt. </p>\n\n<blockquote>\n<p>Do you realize there’s people on this sub I’ve talked to that were about to commit suicide over this stuff?</p>\n</blockquote>\n\n<p>You seem to be making my point for me.  If adjusting to ETH&#39;s (arguably) disappointing reality is this difficult--don&#39;t.  Rather, do what you need to make yourself happy.  Coming here to make other people as miserable as you is not the answer. </p>\n\n<blockquote>\n<p>So I can’t just, again, lie to people.</p>\n</blockquote>\n\n<p>No one is asking you to lie.  Not complaining about price isn&#39;t lying.  </p>\n\n<blockquote>\n<p>people like you know who who are just saying for 2 weeks that ETH will hit $2,500 because as we found out they were underwater on a long. </p>\n</blockquote>\n\n<p>I assume you don&#39;t mean me specifically because that absolutely didn&#39;t happen.</p>\n\n<blockquote>\n<p>Thats price talk is okay because it’s positive?</p>\n</blockquote>\n\n<p>I make it a point to downvote inane positive price talk.  I also make it a point to consider downside targets when looking at TA.  I can back this up with evidence if it matters, but we both know it doesn&#39;t.  </p>\n\n<blockquote>\n<p>I can’t just sit here and have people believe for example the ETH ETF is a huge success when metrics prove otherwise</p>\n</blockquote>\n\n<p>This depends on your measure of success.  Success to me was approval of the ETF; the inflows in the short and medium term are almost entirely irrelevant to the long term thesis.  </p>\n\n<blockquote>\n<p>Everyone here loved to talk about how easy staking is yet my experience has been wasting $1000 on a NUC and probably 100+ hours of trying to learn how to do it.</p>\n</blockquote>\n\n<p>Oh, I agree with this.  I also opposed the endless spam hyping RPL that was prevalent here for years when it was an obvious money grab by the team and early adopters.</p>\n</div>","created_utc":"2024-10-03 10:20:46","distinguished":null,"edited":false,"id":"lq610a0","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq5yf8s","score":1,"stickied":false,"replies":[{"author":"u/Bob-Rossi","body":"I have no reason not to trust what you say, so it’s appreciated that you give similar scrutiny to mindless positive price posts. As well as it’s appreciated to acknowledge the staking issue.\n\nAnd the long thing is absolutely not you. It’s someone else. Maybe you didn’t catch it, but basically an example to say that not all positive only talk is constructive. It was someone who like basically posted “I think we break $2,500” like daily for 2 weeks because they were underwater on a long they opened at $2,500. \n\nFor me, ironically to this discussion… I’ve viewed the ETF success relative to BTC. The outflows don’t necessarily matter in a vacuum, they matter to me in terms of relative flows to Bitcoin. As well as AUM. As my primary concern has been that you would expect BTC vs ETH ETFs to have a similar ratio as actual BTC vs ETH itself. But it doesn’t, and it’s to me a huge sign Tradfi isn’t as accepting of ETH. So in the respect it’s been a flop. \n\nAnd as for the suicide thing, I guess I fail to see how what I’m posting causing people to be miserable. Or atleast, I understand it’s not a feel good discussion but I don’t think I fuel the fire… I feel I very rarely make negative top level posts, mostly stuff like this were I’m just responding to people who brought it up. When I do I try to bring in data points and anecdotal evidence (https://www.reddit.com/r/ethfinance/s/GLtY4Tg3rp) And I try my best to call out others for their bad behavior (https://www.reddit.com/r/ethfinance/s/Oxb5gUeHLJ) or in some cases I’ve advocated selling / readjusting your risk tolerance (https://www.reddit.com/r/ethfinance/s/dScGn1XDJA & https://www.reddit.com/r/ethfinance/s/Z9tgDyx5At)\n\nNo one is perfect, but please understand it’s though to feel like you’re doing the right thing 95% of the time and then get hammered on the 5% grey area.","body_html":"<div class=\"md\"><p>I have no reason not to trust what you say, so it’s appreciated that you give similar scrutiny to mindless positive price posts. As well as it’s appreciated to acknowledge the staking issue.</p>\n\n<p>And the long thing is absolutely not you. It’s someone else. Maybe you didn’t catch it, but basically an example to say that not all positive only talk is constructive. It was someone who like basically posted “I think we break $2,500” like daily for 2 weeks because they were underwater on a long they opened at $2,500. </p>\n\n<p>For me, ironically to this discussion… I’ve viewed the ETF success relative to BTC. The outflows don’t necessarily matter in a vacuum, they matter to me in terms of relative flows to Bitcoin. As well as AUM. As my primary concern has been that you would expect BTC vs ETH ETFs to have a similar ratio as actual BTC vs ETH itself. But it doesn’t, and it’s to me a huge sign Tradfi isn’t as accepting of ETH. So in the respect it’s been a flop. </p>\n\n<p>And as for the suicide thing, I guess I fail to see how what I’m posting causing people to be miserable. Or atleast, I understand it’s not a feel good discussion but I don’t think I fuel the fire… I feel I very rarely make negative top level posts, mostly stuff like this were I’m just responding to people who brought it up. When I do I try to bring in data points and anecdotal evidence (<a href=\"https://www.reddit.com/r/ethfinance/s/GLtY4Tg3rp\">https://www.reddit.com/r/ethfinance/s/GLtY4Tg3rp</a>) And I try my best to call out others for their bad behavior (<a href=\"https://www.reddit.com/r/ethfinance/s/Oxb5gUeHLJ\">https://www.reddit.com/r/ethfinance/s/Oxb5gUeHLJ</a>) or in some cases I’ve advocated selling / readjusting your risk tolerance (<a href=\"https://www.reddit.com/r/ethfinance/s/dScGn1XDJA\">https://www.reddit.com/r/ethfinance/s/dScGn1XDJA</a> &amp; <a href=\"https://www.reddit.com/r/ethfinance/s/Z9tgDyx5At\">https://www.reddit.com/r/ethfinance/s/Z9tgDyx5At</a>)</p>\n\n<p>No one is perfect, but please understand it’s though to feel like you’re doing the right thing 95% of the time and then get hammered on the 5% grey area.</p>\n</div>","created_utc":"2024-10-03 10:43:50","distinguished":null,"edited":false,"id":"lq65eju","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq610a0","score":1,"stickied":false,"replies":[{"author":"u/Alatarlhun","body":">you would expect BTC vs ETH ETFs to have a similar ratio as actual BTC vs ETH itself. But it doesn’t, and it’s to me a huge sign Tradfi isn’t as accepting of ETH\n\nI commend the active interest and research but you didn't need to look at relative flows or AUM to know this. I think this says more about your expectations, perhaps egged on consciously or not by others.  \n\n>And as for the suicide thing, I guess I fail to see how what I’m posting causing people to be miserable.\n\nThese are related but distinct.  Objectively, whining about price is miserable behavior seeking the company of others.  But both this behavior and investment related suicides stem from individuals failing to understand their own risk tolerance and/or holding expectations that are misaligned to reality. \n\nAnd btw, this comes at a time of what appears to be entirely normal levels of volatility.  This isn't some black swan event.  This a 10% price drop over a week after a 13% price rise over the previous two weeks.  \n\n>No one is perfect, but please understand it’s though to feel like you’re doing the right thing 95% of the time and then get hammered on the 5% grey area.\n\nIf you really feel this way having been around for 40x (or more) price increase, then I think that 95% might be a little overstated.   But hey, I really don't know your situation.  Maybe you the universe has randomly aligned against you.  There are always statistical outliers.  In any case, change starts from within.","body_html":"<div class=\"md\"><blockquote>\n<p>you would expect BTC vs ETH ETFs to have a similar ratio as actual BTC vs ETH itself. But it doesn’t, and it’s to me a huge sign Tradfi isn’t as accepting of ETH</p>\n</blockquote>\n\n<p>I commend the active interest and research but you didn&#39;t need to look at relative flows or AUM to know this. I think this says more about your expectations, perhaps egged on consciously or not by others.  </p>\n\n<blockquote>\n<p>And as for the suicide thing, I guess I fail to see how what I’m posting causing people to be miserable.</p>\n</blockquote>\n\n<p>These are related but distinct.  Objectively, whining about price is miserable behavior seeking the company of others.  But both this behavior and investment related suicides stem from individuals failing to understand their own risk tolerance and/or holding expectations that are misaligned to reality. </p>\n\n<p>And btw, this comes at a time of what appears to be entirely normal levels of volatility.  This isn&#39;t some black swan event.  This a 10% price drop over a week after a 13% price rise over the previous two weeks.  </p>\n\n<blockquote>\n<p>No one is perfect, but please understand it’s though to feel like you’re doing the right thing 95% of the time and then get hammered on the 5% grey area.</p>\n</blockquote>\n\n<p>If you really feel this way having been around for 40x (or more) price increase, then I think that 95% might be a little overstated.   But hey, I really don&#39;t know your situation.  Maybe you the universe has randomly aligned against you.  There are always statistical outliers.  In any case, change starts from within.</p>\n</div>","created_utc":"2024-10-03 12:16:17","distinguished":null,"edited":false,"id":"lq6n0fy","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq65eju","score":1,"stickied":false,"replies":[{"author":"u/Bob-Rossi","body":"I’m not really sure I understand 95% reply… my point was that I feel like I’m “doing the right thing” in terms of what I post here. And there’s probably examples here and there where I get too negative or combative. I’m not sure what that has to do with the universe aligning against me. It wasn’t an investment comment? If that’s what you thought…. I’m saying in the context of posting in this sub. I’m very very far from being 95% right on my trades.\n\nYou do know that even thought I’ve been around since like <$10 that doesn’t mean I dumped $100,000 into it back then. I was in college and working an unpaid internship when I first got in. I threw like a $1000 or something into to (a lot for the time) and sort of just let it ride. Sold a lot of that wayyy too early (like double digits). Lost on other shit coins. Gambled away like 10 BTC years ago. I have added some, sold some more. I’ve made enough that it’s impacted my life but I’m still going to be working into my late 50s probably. \n\nIt feels like you are stuffing old timers in this box you formed based on 20/20 hindsight. Of like this “well you were there so you should have benefited”. And because I didn’t jump 2 feet in a half decade ago I’m supposed to be silent and I’m not allowed to criticize things.\n\nThe frustrations as I mentioned go beyond just price. And you acknowledged some of those are fair. So idk what to really say to that because Ethereum isn’t immune from criticism. Which again you said is fine. But going way back to the top of this thread the “you need to think on the timeframe of years” relates to tech things too. ie again how staking has been live for a few years and the experience still sucks.","body_html":"<div class=\"md\"><p>I’m not really sure I understand 95% reply… my point was that I feel like I’m “doing the right thing” in terms of what I post here. And there’s probably examples here and there where I get too negative or combative. I’m not sure what that has to do with the universe aligning against me. It wasn’t an investment comment? If that’s what you thought…. I’m saying in the context of posting in this sub. I’m very very far from being 95% right on my trades.</p>\n\n<p>You do know that even thought I’ve been around since like &lt;$10 that doesn’t mean I dumped $100,000 into it back then. I was in college and working an unpaid internship when I first got in. I threw like a $1000 or something into to (a lot for the time) and sort of just let it ride. Sold a lot of that wayyy too early (like double digits). Lost on other shit coins. Gambled away like 10 BTC years ago. I have added some, sold some more. I’ve made enough that it’s impacted my life but I’m still going to be working into my late 50s probably. </p>\n\n<p>It feels like you are stuffing old timers in this box you formed based on 20/20 hindsight. Of like this “well you were there so you should have benefited”. And because I didn’t jump 2 feet in a half decade ago I’m supposed to be silent and I’m not allowed to criticize things.</p>\n\n<p>The frustrations as I mentioned go beyond just price. And you acknowledged some of those are fair. So idk what to really say to that because Ethereum isn’t immune from criticism. Which again you said is fine. But going way back to the top of this thread the “you need to think on the timeframe of years” relates to tech things too. ie again how staking has been live for a few years and the experience still sucks.</p>\n</div>","created_utc":"2024-10-03 12:39:07","distinguished":null,"edited":false,"id":"lq6rbym","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq6n0fy","score":1,"stickied":false,"replies":[{"author":"u/Alatarlhun","body":"> It feels like you are stuffing old timers in this box you formed based on 20/20 hindsight. Of like this “well you were there so you should have benefited”.\n\nYou like virtually all of us have made mistakes.  I would suggest complaining about price is one of those emotional mindsets that leads to more mistakes.  And yes, I do expect your experience to have resulted in wisdom when it comes to giving in to emotion when it comes financial decisions.  \n\n>Of like this “well you were there so you should have benefited”.\n\nYou either benefited a great deal or you learned something about risk tolerances and expectations.  If it was to learn to whine about price then the fucks I have to give are approaching zero.  🤷‍♀️\n\n> I’m supposed to be silent and I’m not allowed to criticize things.\n\nNo, you are are simply being asked to hold yourself to the same standard as anyone of any age or experience by criticizing the real issues and not price.  \n\n>again how staking has been live for a few years and the experience still sucks.\n\nI don't think native staking administrator experience is a priority and liquid staking is a reasonable alternative in the marketplace.  That said, I don't think anyone should consider ETH staking emissions risk free.  Unfortunately, that myth persists.","body_html":"<div class=\"md\"><blockquote>\n<p>It feels like you are stuffing old timers in this box you formed based on 20/20 hindsight. Of like this “well you were there so you should have benefited”.</p>\n</blockquote>\n\n<p>You like virtually all of us have made mistakes.  I would suggest complaining about price is one of those emotional mindsets that leads to more mistakes.  And yes, I do expect your experience to have resulted in wisdom when it comes to giving in to emotion when it comes financial decisions.  </p>\n\n<blockquote>\n<p>Of like this “well you were there so you should have benefited”.</p>\n</blockquote>\n\n<p>You either benefited a great deal or you learned something about risk tolerances and expectations.  If it was to learn to whine about price then the fucks I have to give are approaching zero.  🤷‍♀️</p>\n\n<blockquote>\n<p>I’m supposed to be silent and I’m not allowed to criticize things.</p>\n</blockquote>\n\n<p>No, you are are simply being asked to hold yourself to the same standard as anyone of any age or experience by criticizing the real issues and not price.  </p>\n\n<blockquote>\n<p>again how staking has been live for a few years and the experience still sucks.</p>\n</blockquote>\n\n<p>I don&#39;t think native staking administrator experience is a priority and liquid staking is a reasonable alternative in the marketplace.  That said, I don&#39;t think anyone should consider ETH staking emissions risk free.  Unfortunately, that myth persists.</p>\n</div>","created_utc":"2024-10-03 13:07:47","distinguished":null,"edited":false,"id":"lq6wra7","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq6rbym","score":1,"stickied":false,"replies":[{"author":"u/Bob-Rossi","body":"Okay, so why are you so hyped focused on the 5% of the time I whine about price? I just linked you multiple examples of when I have used my experience to help other people recognize the importance of risk tolerance this month. And now multiple examples of things I’ve criticized that are not related to price. As well as an example of discussion around ETF data. \n\nYet you are telling me all I learned was how to whine about price when I have given you examples to contrary… \n\nIf you are saying I have a reputation then you must know I’ve done probably atleast a dozen things in this space that go beyond basic shit posting on Reddit. All things I’ve used from this experience to do good - posted educational content, support rallying for EIPs & PoS, education on ETHE & grayscale, governance work, literally now I’m on a grant committee and I helped HOP get grant funds as well??? Like this is my point you’re attacking me because I’ve made a few passing response comments that the price action sucks and you’re just negating all the good I’ve done over 8 years.","body_html":"<div class=\"md\"><p>Okay, so why are you so hyped focused on the 5% of the time I whine about price? I just linked you multiple examples of when I have used my experience to help other people recognize the importance of risk tolerance this month. And now multiple examples of things I’ve criticized that are not related to price. As well as an example of discussion around ETF data. </p>\n\n<p>Yet you are telling me all I learned was how to whine about price when I have given you examples to contrary… </p>\n\n<p>If you are saying I have a reputation then you must know I’ve done probably atleast a dozen things in this space that go beyond basic shit posting on Reddit. All things I’ve used from this experience to do good - posted educational content, support rallying for EIPs &amp; PoS, education on ETHE &amp; grayscale, governance work, literally now I’m on a grant committee and I helped HOP get grant funds as well??? Like this is my point you’re attacking me because I’ve made a few passing response comments that the price action sucks and you’re just negating all the good I’ve done over 8 years.</p>\n</div>","created_utc":"2024-10-03 13:21:11","distinguished":null,"edited":false,"id":"lq6zc8v","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq6wra7","score":1,"stickied":false,"replies":[{"author":"u/Alatarlhun","body":">Okay, so why are you so hyped focused on the 5% of the time I whine about price?\n\nThat's like asking why people don't give you credit for the 95% of the time you aren't breaking the law. \n\n >Yet you are telling me all I learned was how to whine about price when I have given you examples to contrary… \n\nAnd yet 5% of the time you aren't, which 5% too much.  Ego and bruised pride aside, I know this is an understandable point.  \n\n>I’ve made a few passing response comments that the price action sucks and you’re just negating all the good I’ve done over 8 years.\n\nIt ain't personal, kid.  And thank you for all you do.","body_html":"<div class=\"md\"><blockquote>\n<p>Okay, so why are you so hyped focused on the 5% of the time I whine about price?</p>\n</blockquote>\n\n<p>That&#39;s like asking why people don&#39;t give you credit for the 95% of the time you aren&#39;t breaking the law. </p>\n\n<blockquote>\n<p>Yet you are telling me all I learned was how to whine about price when I have given you examples to contrary… </p>\n</blockquote>\n\n<p>And yet 5% of the time you aren&#39;t, which 5% too much.  Ego and bruised pride aside, I know this is an understandable point.  </p>\n\n<blockquote>\n<p>I’ve made a few passing response comments that the price action sucks and you’re just negating all the good I’ve done over 8 years.</p>\n</blockquote>\n\n<p>It ain&#39;t personal, kid.  And thank you for all you do.</p>\n</div>","created_utc":"2024-10-03 13:31:57","distinguished":null,"edited":false,"id":"lq71fyp","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq6zc8v","score":1,"stickied":false,"replies":[{"author":"u/Bob-Rossi","body":">And thank you for all you do.\n\nSo after spending half the day making me feel like shit, do you even mean this?","body_html":"<div class=\"md\"><blockquote>\n<p>And thank you for all you do.</p>\n</blockquote>\n\n<p>So after spending half the day making me feel like shit, do you even mean this?</p>\n</div>","created_utc":"2024-10-03 13:44:16","distinguished":null,"edited":false,"id":"lq73t1j","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq71fyp","score":1,"stickied":false,"replies":[{"author":"u/Alatarlhun","body":"Earnestly.","body_html":"<div class=\"md\"><p>Earnestly.</p>\n</div>","created_utc":"2024-10-03 15:14:48","distinguished":null,"edited":false,"id":"lq7jygu","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq73t1j","score":2,"stickied":false,"replies":[{"author":"u/Bob-Rossi","body":"Thank you","body_html":"<div class=\"md\"><p>Thank you</p>\n</div>","created_utc":"2024-10-03 17:02:10","distinguished":null,"edited":false,"id":"lq81flc","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq7jygu","score":2,"stickied":false,"replies":[]}]}]}]}]},{"author":"u/Bob-Rossi","body":"[#SupportEIP1559 🔥 - Protect Ethereum’s transaction user experience from attack.](https://supporteip1559.org/)\n\n[https://ethmerge.com/?q=what-is-the-triple-halvening](https://ethmerge.com/?q=what-is-the-triple-halvening)\n\n[bobrossi.eth's Delegate Profile (tally.xyz)](https://www.tally.xyz/gov/hop/delegate/bobrossi.eth)\n\n[Powerhouse Connect (arbgrants.com)](https://www.arbgrants.com/d/Arbitrum%20LTIPP/Grants-G-L/HOP-Protocol) (I spearheaded this for HOP)\n\n[GitHub - BobRossiETH/ETH-Staking-Service-22Cap-Signaling: List of Staking Providers Who Have Publicly Signaled to Cap Validator Control at 22%](https://github.com/BobRossiETH/ETH-Staking-Service-22Cap-Signaling)\n\n[Project Sunshine | Ethereum (ethsunshine.com)](https://ethsunshine.com/) (I wrote for some of this -[GitHub - etheralpha/project-sunshine: This is the source code for https://ethsunshine.com, a site to monitor the Ethereum's decentralization health.](https://github.com/etheralpha/project-sunshine))\n\n[GitHub - BobRossiETH/1559-outreach: Outreach related to EIP-1559](https://github.com/BobRossiETH/1559-outreach)\n\n[https://www.reddit.com/r/ethfinance/comments/hc3uto/ethe\\_gbtc\\_grayscale\\_frequently\\_asked\\_questions/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/ethfinance/comments/hc3uto/ethe_gbtc_grayscale_frequently_asked_questions/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\n[https://www.reddit.com/r/ethfinance/comments/khm92g/ethe\\_reduction\\_to\\_6\\_month\\_wait\\_period\\_supply/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/ethfinance/comments/khm92g/ethe_reduction_to_6_month_wait_period_supply/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)","body_html":"<div class=\"md\"><p><a href=\"https://supporteip1559.org/\">#SupportEIP1559 🔥 - Protect Ethereum’s transaction user experience from attack.</a></p>\n\n<p><a href=\"https://ethmerge.com/?q=what-is-the-triple-halvening\">https://ethmerge.com/?q=what-is-the-triple-halvening</a></p>\n\n<p><a href=\"https://www.tally.xyz/gov/hop/delegate/bobrossi.eth\">bobrossi.eth&#39;s Delegate Profile (tally.xyz)</a></p>\n\n<p><a href=\"https://www.arbgrants.com/d/Arbitrum%20LTIPP/Grants-G-L/HOP-Protocol\">Powerhouse Connect (arbgrants.com)</a> (I spearheaded this for HOP)</p>\n\n<p><a href=\"https://github.com/BobRossiETH/ETH-Staking-Service-22Cap-Signaling\">GitHub - BobRossiETH/ETH-Staking-Service-22Cap-Signaling: List of Staking Providers Who Have Publicly Signaled to Cap Validator Control at 22%</a></p>\n\n<p><a href=\"https://ethsunshine.com/\">Project Sunshine | Ethereum (ethsunshine.com)</a> (I wrote for some of this -<a href=\"https://github.com/etheralpha/project-sunshine\">GitHub - etheralpha/project-sunshine: This is the source code for https://ethsunshine.com, a site to monitor the Ethereum&#39;s decentralization health.</a>)</p>\n\n<p><a href=\"https://github.com/BobRossiETH/1559-outreach\">GitHub - BobRossiETH/1559-outreach: Outreach related to EIP-1559</a></p>\n\n<p><a href=\"https://www.reddit.com/r/ethfinance/comments/hc3uto/ethe_gbtc_grayscale_frequently_asked_questions/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button\">https://www.reddit.com/r/ethfinance/comments/hc3uto/ethe_gbtc_grayscale_frequently_asked_questions/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button</a></p>\n\n<p><a href=\"https://www.reddit.com/r/ethfinance/comments/khm92g/ethe_reduction_to_6_month_wait_period_supply/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button\">https://www.reddit.com/r/ethfinance/comments/khm92g/ethe_reduction_to_6_month_wait_period_supply/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button</a></p>\n</div>","created_utc":"2024-10-03 13:28:17","distinguished":null,"edited":false,"id":"lq70q34","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq6wra7","score":1,"stickied":false,"replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]},{"author":"u/Stobie","body":"I don't expect price of native asset to follow quality of network in short term. But if you just look at ETH/BTC price ratio since 2015 even then it's spent about half the time lower than now.","body_html":"<div class=\"md\"><p>I don&#39;t expect price of native asset to follow quality of network in short term. But if you just look at ETH/BTC price ratio since 2015 even then it&#39;s spent about half the time lower than now.</p>\n</div>","created_utc":"2024-10-02 17:16:12","distinguished":null,"edited":false,"id":"lq2945k","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq242vp","score":1,"stickied":false,"replies":[]}]}]},{"author":"[deleted]","body":"[removed]","body_html":"<div class=\"md\"><p>[removed]</p>\n</div>","created_utc":"2024-10-02 20:48:33","distinguished":null,"edited":false,"id":"lq34t11","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1zzz0","score":-2,"stickied":false,"replies":[{"author":"u/Tricky_Troll","body":"My initial response to your comment was a bit knee jerky as there has been a lot of trolls lately, so my apologies there. But I would like to remind you of Rule #1. I get the impression you weren't intentionally trolling. But your comment reads like a troll who comes here in bad faith. If you truly feel like Ethereum isn't a legitimate project then you need to make your case with evidence, not just bold claims with nothing behind them. I get that the market has been rough, but this is not the first time that the market has been sleeping on Ethereum's progress. I'm getting late 2019 to early/mid 2020 vibes around here. New tech gets rolled out on Ethereum but price just doesn't care. It will catch up eventually if cheap decentralised block space is valuable. If it's not, then we've been wrong about crypto as a whole all along.\n\nAnyway, please refer to rule #1. Be friendly and if you are bearish, give us some reasons with a sound argument and numbers to back it up. Bold, baseless claims and spreading misinformation is considered trolling and will result in a ban.","body_html":"<div class=\"md\"><p>My initial response to your comment was a bit knee jerky as there has been a lot of trolls lately, so my apologies there. But I would like to remind you of Rule #1. I get the impression you weren&#39;t intentionally trolling. But your comment reads like a troll who comes here in bad faith. If you truly feel like Ethereum isn&#39;t a legitimate project then you need to make your case with evidence, not just bold claims with nothing behind them. I get that the market has been rough, but this is not the first time that the market has been sleeping on Ethereum&#39;s progress. I&#39;m getting late 2019 to early/mid 2020 vibes around here. New tech gets rolled out on Ethereum but price just doesn&#39;t care. It will catch up eventually if cheap decentralised block space is valuable. If it&#39;s not, then we&#39;ve been wrong about crypto as a whole all along.</p>\n\n<p>Anyway, please refer to rule #1. Be friendly and if you are bearish, give us some reasons with a sound argument and numbers to back it up. Bold, baseless claims and spreading misinformation is considered trolling and will result in a ban.</p>\n</div>","created_utc":"2024-10-02 21:42:24","distinguished":"moderator","edited":false,"id":"lq3b3dp","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq34t11","score":4,"stickied":false,"replies":[]},{"author":"u/Tricky_Troll","body":"Hmm, it's almost like the Ethereum Foundation is building something and has R&D expenses to pay...\n\nThis is the stupidest low effort FUD there is. Go back to r/buttcoin.","body_html":"<div class=\"md\"><p>Hmm, it&#39;s almost like the Ethereum Foundation is building something and has R&amp;D expenses to pay...</p>\n\n<p>This is the stupidest low effort FUD there is. Go back to <a href=\"/r/buttcoin\">r/buttcoin</a>.</p>\n</div>","created_utc":"2024-10-02 21:01:41","distinguished":"moderator","edited":false,"id":"lq36en8","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq34t11","score":2,"stickied":false,"replies":[{"author":"[deleted]","body":"[deleted]","body_html":"<div class=\"md\"><p>[deleted]</p>\n</div>","created_utc":"2024-10-02 21:04:40","distinguished":null,"edited":false,"id":"lq36rjy","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq36en8","score":-4,"stickied":false,"replies":[{"author":"u/Tricky_Troll","body":"The burden of proof is on you, you made the first claim about the EF wasting funds. Besides, if you think the EF is just here for a pump and dump, then you're welcome to sell your ETH and leave. But if they were doing a pump and dump, I have no idea why they'd have been building out Ethereum for almost 10 years now, literally leading blockchain technological development.","body_html":"<div class=\"md\"><p>The burden of proof is on you, you made the first claim about the EF wasting funds. Besides, if you think the EF is just here for a pump and dump, then you&#39;re welcome to sell your ETH and leave. But if they were doing a pump and dump, I have no idea why they&#39;d have been building out Ethereum for almost 10 years now, literally leading blockchain technological development.</p>\n</div>","created_utc":"2024-10-02 21:08:26","distinguished":"moderator","edited":"2024-10-02 21:36:42","id":"lq377rz","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq36rjy","score":4,"stickied":false,"replies":[]}]}]}]}]},{"author":"u/clamchoda","body":"༼ つ ◕_◕ ༽つ ETH TAKE MY ENERGY ༼ つ ◕_◕ ༽つ","body_html":"<div class=\"md\"><p>༼ つ ◕_◕ ༽つ ETH TAKE MY ENERGY ༼ つ ◕_◕ ༽つ</p>\n</div>","created_utc":"2024-10-03 11:48:50","distinguished":null,"edited":false,"id":"lq6htq1","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":5,"stickied":false,"replies":[]},{"author":"u/bagogel12","body":"Sorry guys, I just bought some more.","body_html":"<div class=\"md\"><p>Sorry guys, I just bought some more.</p>\n</div>","created_utc":"2024-10-02 12:03:03","distinguished":null,"edited":"2024-10-02 12:13:25","id":"lq0r7mf","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":13,"stickied":false,"replies":[]},{"author":"u/CaptainLoud","body":"Fade the flairs.","body_html":"<div class=\"md\"><p>Fade the flairs.</p>\n</div>","created_utc":"2024-10-02 13:37:35","distinguished":null,"edited":false,"id":"lq1935d","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":9,"stickied":false,"replies":[{"author":"u/Tricky_Troll","body":"What does that even mean? Fade has numerous slang meanings and none of them make all that much sense to me in this context.","body_html":"<div class=\"md\"><p>What does that even mean? Fade has numerous slang meanings and none of them make all that much sense to me in this context.</p>\n</div>","created_utc":"2024-10-02 18:06:54","distinguished":null,"edited":false,"id":"lq2h3wu","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1935d","score":4,"stickied":false,"replies":[{"author":"u/CaptainLoud","body":"Haha it's a joke. In the sports subreddits (such as /r/nba), when a team is eliminated in the playoffs, people say \"fade the flairs\". Team flairs on the subreddit are faded to show who is left playing, via the comment section and people rib each other.","body_html":"<div class=\"md\"><p>Haha it&#39;s a joke. In the sports subreddits (such as <a href=\"/r/nba\">/r/nba</a>), when a team is eliminated in the playoffs, people say &quot;fade the flairs&quot;. Team flairs on the subreddit are faded to show who is left playing, via the comment section and people rib each other.</p>\n</div>","created_utc":"2024-10-02 19:59:54","distinguished":null,"edited":false,"id":"lq2ycjx","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq2h3wu","score":3,"stickied":false,"replies":[{"author":"u/Tricky_Troll","body":"Thanks for filling me in!","body_html":"<div class=\"md\"><p>Thanks for filling me in!</p>\n</div>","created_utc":"2024-10-02 20:48:24","distinguished":null,"edited":false,"id":"lq34sdm","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq2ycjx","score":3,"stickied":false,"replies":[]}]}]}]},{"author":"[deleted]","body":"[deleted]","body_html":"<div class=\"md\"><p>[deleted]</p>\n</div>","created_utc":"2024-10-02 20:33:27","distinguished":null,"edited":false,"id":"lq32vri","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":13,"stickied":false,"replies":[{"author":"u/amufydd","body":"ETH is a total shitcoin in this run, I'm sick of looking at it bad performance","body_html":"<div class=\"md\"><p>ETH is a total shitcoin in this run, I&#39;m sick of looking at it bad performance</p>\n</div>","created_utc":"2024-10-02 23:21:04","distinguished":null,"edited":false,"id":"lq3kxrz","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq32vri","score":5,"stickied":false,"replies":[]}]},{"author":"u/Itur_ad_Astra","body":"A month ago I hoped that the crash from $3.5k to $2k (which I saw coming) would recover quickly to at least $3k.\n\nUnfortunately this definitely does not seem to be the case. It feels like the last time ETH was so weak was more than 5 years ago.\n\nMy gut tells me that ETH really wants to do a violent breakout sub $2k, to around $1700. Maybe instead of a Nov-Feb pump, which many expected, we have a really low point around December, which we have seen many times before. Then a very slow recovery starting January.\n\nWhat do you guys think?\n\nP.S.: World events are irrelevant in crypto and only bring forward the action that was going to happen anyway.","body_html":"<div class=\"md\"><p>A month ago I hoped that the crash from $3.5k to $2k (which I saw coming) would recover quickly to at least $3k.</p>\n\n<p>Unfortunately this definitely does not seem to be the case. It feels like the last time ETH was so weak was more than 5 years ago.</p>\n\n<p>My gut tells me that ETH really wants to do a violent breakout sub $2k, to around $1700. Maybe instead of a Nov-Feb pump, which many expected, we have a really low point around December, which we have seen many times before. Then a very slow recovery starting January.</p>\n\n<p>What do you guys think?</p>\n\n<p>P.S.: World events are irrelevant in crypto and only bring forward the action that was going to happen anyway.</p>\n</div>","created_utc":"2024-10-02 05:15:34","distinguished":null,"edited":false,"id":"lpyqhwr","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":13,"stickied":false,"replies":[{"author":"u/aaj094","body":"This is just pure speculation so pointless to have a go stating one way or another. All I can say is that it's better to speculate on the ratio than on fiat price. Fiat price very much remains tied to bitcoin and that's not gonna change any time soon.","body_html":"<div class=\"md\"><p>This is just pure speculation so pointless to have a go stating one way or another. All I can say is that it&#39;s better to speculate on the ratio than on fiat price. Fiat price very much remains tied to bitcoin and that&#39;s not gonna change any time soon.</p>\n</div>","created_utc":"2024-10-02 05:39:28","distinguished":null,"edited":false,"id":"lpytu4u","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpyqhwr","score":9,"stickied":false,"replies":[{"author":"u/Itur_ad_Astra","body":"I mean, I don't claim that it is anything else other than speculation!\n\nIt's just that my gut feeling is right most of the time...","body_html":"<div class=\"md\"><p>I mean, I don&#39;t claim that it is anything else other than speculation!</p>\n\n<p>It&#39;s just that my gut feeling is right most of the time...</p>\n</div>","created_utc":"2024-10-02 06:25:56","distinguished":null,"edited":false,"id":"lpz0x8b","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpytu4u","score":2,"stickied":false,"replies":[{"author":"u/aaj094","body":"Most often when one feels like this, it's because you tend to remember cases when your gut was right. Try paper trading on your gut consistently for a while and see how you do.","body_html":"<div class=\"md\"><p>Most often when one feels like this, it&#39;s because you tend to remember cases when your gut was right. Try paper trading on your gut consistently for a while and see how you do.</p>\n</div>","created_utc":"2024-10-02 06:43:50","distinguished":null,"edited":false,"id":"lpz3srm","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpz0x8b","score":7,"stickied":false,"replies":[{"author":"u/Itur_ad_Astra","body":"I actually have. The sample is not yet sufficient to be statistically significant, but I'm like 80% correct on my paper trades...","body_html":"<div class=\"md\"><p>I actually have. The sample is not yet sufficient to be statistically significant, but I&#39;m like 80% correct on my paper trades...</p>\n</div>","created_utc":"2024-10-02 06:51:20","distinguished":null,"edited":false,"id":"lpz51vv","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpz3srm","score":2,"stickied":false,"replies":[{"author":"u/aaj094","body":"Good luck then to move from paper to real then. Hope to see you report back on this in say 6 months.","body_html":"<div class=\"md\"><p>Good luck then to move from paper to real then. Hope to see you report back on this in say 6 months.</p>\n</div>","created_utc":"2024-10-02 06:55:21","distinguished":null,"edited":false,"id":"lpz5qkg","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpz51vv","score":6,"stickied":false,"replies":[]}]}]}]}]},{"author":"u/Shitshotdead","body":"I think the current uncertainty in the global condition would actually help us go up in Q4 and Q1. Global Liquidity is on the rise and I think this will be the major mover.","body_html":"<div class=\"md\"><p>I think the current uncertainty in the global condition would actually help us go up in Q4 and Q1. Global Liquidity is on the rise and I think this will be the major mover.</p>\n</div>","created_utc":"2024-10-02 05:40:26","distinguished":null,"edited":false,"id":"lpytz55","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpyqhwr","score":6,"stickied":false,"replies":[]},{"author":"u/Bob-Rossi","body":"I’ve been pretty bearish on price the last few months. I did buy some a week or so ago as it felt like maybe the bottom was in, guess that was wrong… humbling as always.\n\nRegardless, I’m gonna sell what I bought a few weeks ago and just eat the loss as a bad trade. It wasn’t that much anyway. Back to thinking we go lower on price and double confident the ratio is going to continue to be hammered downward.","body_html":"<div class=\"md\"><p>I’ve been pretty bearish on price the last few months. I did buy some a week or so ago as it felt like maybe the bottom was in, guess that was wrong… humbling as always.</p>\n\n<p>Regardless, I’m gonna sell what I bought a few weeks ago and just eat the loss as a bad trade. It wasn’t that much anyway. Back to thinking we go lower on price and double confident the ratio is going to continue to be hammered downward.</p>\n</div>","created_utc":"2024-10-02 06:04:36","distinguished":null,"edited":false,"id":"lpyxln8","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpyqhwr","score":7,"stickied":false,"replies":[]},{"author":"u/jaskidd05","body":"Tbh… I expected last week crash under 0,038x as the bottom but.. seems like the current geopolitical status is moving us even lower","body_html":"<div class=\"md\"><p>Tbh… I expected last week crash under 0,038x as the bottom but.. seems like the current geopolitical status is moving us even lower</p>\n</div>","created_utc":"2024-10-02 07:28:32","distinguished":null,"edited":false,"id":"lpzbiay","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpyqhwr","score":3,"stickied":false,"replies":[]},{"author":"u/actualbadger","body":"I think we were on the path to hit $70k / $3k in October until the Middle East starting kicking off again. 50bps rate cut, US employment looking stable, China stimulus, ETF inflows - all looking good.\n\nNow I just don't know. I did sell a big chunk of my holdings at $3100 so I don't feel too exposed - but I'm also not planning to buy back in.\n\nWhat do you mean \"world events are irrelevant in crypto\"?","body_html":"<div class=\"md\"><p>I think we were on the path to hit $70k / $3k in October until the Middle East starting kicking off again. 50bps rate cut, US employment looking stable, China stimulus, ETF inflows - all looking good.</p>\n\n<p>Now I just don&#39;t know. I did sell a big chunk of my holdings at $3100 so I don&#39;t feel too exposed - but I&#39;m also not planning to buy back in.</p>\n\n<p>What do you mean &quot;world events are irrelevant in crypto&quot;?</p>\n</div>","created_utc":"2024-10-02 13:29:14","distinguished":null,"edited":false,"id":"lq17hjd","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpyqhwr","score":2,"stickied":false,"replies":[]}]},{"author":"u/theDAObacle","body":"I am having difficulty revoking wallet permissions on Etherscan, is there anywhere else reliable that I can revoke.\n\nI use a Ledger so not sure if they have a way to do it directly.\n\nAny suggestions appreciated!","body_html":"<div class=\"md\"><p>I am having difficulty revoking wallet permissions on Etherscan, is there anywhere else reliable that I can revoke.</p>\n\n<p>I use a Ledger so not sure if they have a way to do it directly.</p>\n\n<p>Any suggestions appreciated!</p>\n</div>","created_utc":"2024-10-02 05:19:38","distinguished":null,"edited":false,"id":"lpyr1q7","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":3,"stickied":false,"replies":[{"author":"u/fecalreceptacle","body":"https://revoke.cash/","body_html":"<div class=\"md\"><p><a href=\"https://revoke.cash/\">https://revoke.cash/</a></p>\n</div>","created_utc":"2024-10-02 05:25:59","distinguished":null,"edited":false,"id":"lpyrxas","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpyr1q7","score":11,"stickied":false,"replies":[{"author":"u/theDAObacle","body":"Cheers, is this reliable?","body_html":"<div class=\"md\"><p>Cheers, is this reliable?</p>\n</div>","created_utc":"2024-10-02 05:35:31","distinguished":null,"edited":false,"id":"lpyt9nd","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpyrxas","score":4,"stickied":false,"replies":[{"author":"u/fecalreceptacle","body":"Been trusted by ethfinance for years","body_html":"<div class=\"md\"><p>Been trusted by ethfinance for years</p>\n</div>","created_utc":"2024-10-02 05:39:30","distinguished":null,"edited":false,"id":"lpytu8y","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpyt9nd","score":13,"stickied":false,"replies":[]}]}]}]},{"author":"[deleted]","body":"Anyone following Aethir project and ATH token?","body_html":"<div class=\"md\"><p>Anyone following Aethir project and ATH token?</p>\n</div>","created_utc":"2024-10-02 12:31:47","distinguished":null,"edited":false,"id":"lq0wm5h","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":3,"stickied":false,"replies":[{"author":"u/LogrisTheBard","body":"Yes.","body_html":"<div class=\"md\"><p>Yes.</p>\n</div>","created_utc":"2024-10-02 14:31:08","distinguished":null,"edited":false,"id":"lq1jb4t","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq0wm5h","score":2,"stickied":false,"replies":[{"author":"[deleted]","body":"Is this a good place to ask your opinion on it?","body_html":"<div class=\"md\"><p>Is this a good place to ask your opinion on it?</p>\n</div>","created_utc":"2024-10-02 14:52:13","distinguished":null,"edited":false,"id":"lq1n45h","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1jb4t","score":2,"stickied":false,"replies":[{"author":"u/LogrisTheBard","body":"My opinion on that sector and their platform in particular is first-hand and rather expansive. If you want to know something specific ask a more targeted question.","body_html":"<div class=\"md\"><p>My opinion on that sector and their platform in particular is first-hand and rather expansive. If you want to know something specific ask a more targeted question.</p>\n</div>","created_utc":"2024-10-02 15:31:25","distinguished":null,"edited":false,"id":"lq1t4ei","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1n45h","score":2,"stickied":false,"replies":[{"author":"[deleted]","body":"Do you feel the ATH token has potential for short to med term upward price momentum potential?   Do the tokenomics support token price growth?","body_html":"<div class=\"md\"><p>Do you feel the ATH token has potential for short to med term upward price momentum potential?   Do the tokenomics support token price growth?</p>\n</div>","created_utc":"2024-10-02 15:34:23","distinguished":null,"edited":false,"id":"lq1tkbw","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1t4ei","score":2,"stickied":false,"replies":[{"author":"u/LogrisTheBard","body":"DePin brokers are in a congested market. Aethir is competing against IO, Akash, Exabits, Hyperbolic, Spheron, Voltage Park, and Lambda Labs.\n\nThe tokenomics of ATH specifically look exactly like RPL up to now and I suspect the valuation of ATH will take a similar trajectory. In the short term, people will matchmake on brokers and the required stake is going to find a home for the low float circulating right now. Longer term though, I think all of DePin is going to package up compute at the app level, not the bare metal level. Aethir is trying to charge a 20% fee. Does the service they provide justify that fee between the infra provider and the user of the compute? Will they be able to maintain that fee or will the competition in that market generally drive that fee down? At 20% I think both parties are incentivized to connect directly with each other, split the difference, and make more money without the broker. When they do so, the token isn't needed as collateral any more by anyone and the revenue extracted by ATH will dwindle.\n\nI'm not investing at the broker level on any of the brokers for basically this reason though I did make money on an initial broad spectrum play in DePin late last year/early this year that included Akash, BitTensor, and Render and that has done quite well for me. Right now I'm looking at applications that enable bypassing the brokers that find actual product market fit and direct revenue back to token holders and I'll invest in those according to my PE model.","body_html":"<div class=\"md\"><p>DePin brokers are in a congested market. Aethir is competing against IO, Akash, Exabits, Hyperbolic, Spheron, Voltage Park, and Lambda Labs.</p>\n\n<p>The tokenomics of ATH specifically look exactly like RPL up to now and I suspect the valuation of ATH will take a similar trajectory. In the short term, people will matchmake on brokers and the required stake is going to find a home for the low float circulating right now. Longer term though, I think all of DePin is going to package up compute at the app level, not the bare metal level. Aethir is trying to charge a 20% fee. Does the service they provide justify that fee between the infra provider and the user of the compute? Will they be able to maintain that fee or will the competition in that market generally drive that fee down? At 20% I think both parties are incentivized to connect directly with each other, split the difference, and make more money without the broker. When they do so, the token isn&#39;t needed as collateral any more by anyone and the revenue extracted by ATH will dwindle.</p>\n\n<p>I&#39;m not investing at the broker level on any of the brokers for basically this reason though I did make money on an initial broad spectrum play in DePin late last year/early this year that included Akash, BitTensor, and Render and that has done quite well for me. Right now I&#39;m looking at applications that enable bypassing the brokers that find actual product market fit and direct revenue back to token holders and I&#39;ll invest in those according to my PE model.</p>\n</div>","created_utc":"2024-10-02 16:22:44","distinguished":null,"edited":false,"id":"lq20p1k","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1tkbw","score":7,"stickied":false,"replies":[{"author":"[deleted]","body":"Thank you for the detailed reply Logris.","body_html":"<div class=\"md\"><p>Thank you for the detailed reply Logris.</p>\n</div>","created_utc":"2024-10-02 16:24:42","distinguished":null,"edited":false,"id":"lq2108c","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq20p1k","score":1,"stickied":false,"replies":[]}]}]},{"author":"u/Kevkillerke","body":"Lmao, what other question besides \"price go up?\" did you expect","body_html":"<div class=\"md\"><p>Lmao, what other question besides &quot;price go up?&quot; did you expect</p>\n</div>","created_utc":"2024-10-02 16:13:23","distinguished":null,"edited":false,"id":"lq1z8dp","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1t4ei","score":1,"stickied":false,"replies":[{"author":"u/LogrisTheBard","body":"* Are they aligned with the crypto ethos?\n* Where do they fit into the DePin ecosystem?\n* How do they compare with their competitors?\n* What do you think of their tech stack?\n* How big is the opportunity? What's the addressable market cap?\n* Do you know their team? What are your impressions of them?\n* What do you think of the tokenomics? How would you redesign it?","body_html":"<div class=\"md\"><ul>\n<li>Are they aligned with the crypto ethos?</li>\n<li>Where do they fit into the DePin ecosystem?</li>\n<li>How do they compare with their competitors?</li>\n<li>What do you think of their tech stack?</li>\n<li>How big is the opportunity? What&#39;s the addressable market cap?</li>\n<li>Do you know their team? What are your impressions of them?</li>\n<li>What do you think of the tokenomics? How would you redesign it?</li>\n</ul>\n</div>","created_utc":"2024-10-02 17:02:03","distinguished":null,"edited":false,"id":"lq26wgx","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq1z8dp","score":6,"stickied":false,"replies":[]}]}]}]}]}]},{"author":"u/FernadoPoo","body":"PSHAW!","body_html":"<div class=\"md\"><p>PSHAW!</p>\n</div>","created_utc":"2024-10-02 18:58:13","distinguished":null,"edited":"2024-10-02 19:16:20","id":"lq2pai3","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":3,"stickied":false,"replies":[]},{"author":"u/HSuke","body":"Fun fact: If a country does not enough print money to keep up with growing economic output and population, it will eventually experience deflation (assuming that money velocity is constant).","body_html":"<div class=\"md\"><p>Fun fact: If a country does not enough print money to keep up with growing economic output and population, it will eventually experience deflation (assuming that money velocity is constant).</p>\n</div>","created_utc":"2024-10-02 10:11:24","distinguished":null,"edited":false,"id":"lq063vf","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":6,"stickied":false,"replies":[{"author":"u/aaj094","body":"All that said, what happens when there does exist something that cannot be printed? Then would you expect the general public to continue shunning that thing at personal loss but for the supposed larger good?\n\nSame argument for a country instead of general public when it comes to accumulating reserves.\n\nAlso, what's this about people hoarding money. Why do you think they will sacrifice unreasonably on stuff they really want? We all balance current wants vs what we can defer for the future but we still do end up enjoying and living the moment nevertheless. Why would that change? For instance, do you stock to using old tech just because your money will be able to buy better and better tech by deferring your new purchase? I mean, people still keep upgrading nevertheless.\n\nTaking all the above a bit further, has humanity overextended itself and it's use of resources in large part because of a system that creates virtue out of unneeded consumption and is it fiat that has created this system?","body_html":"<div class=\"md\"><p>All that said, what happens when there does exist something that cannot be printed? Then would you expect the general public to continue shunning that thing at personal loss but for the supposed larger good?</p>\n\n<p>Same argument for a country instead of general public when it comes to accumulating reserves.</p>\n\n<p>Also, what&#39;s this about people hoarding money. Why do you think they will sacrifice unreasonably on stuff they really want? We all balance current wants vs what we can defer for the future but we still do end up enjoying and living the moment nevertheless. Why would that change? For instance, do you stock to using old tech just because your money will be able to buy better and better tech by deferring your new purchase? I mean, people still keep upgrading nevertheless.</p>\n\n<p>Taking all the above a bit further, has humanity overextended itself and it&#39;s use of resources in large part because of a system that creates virtue out of unneeded consumption and is it fiat that has created this system?</p>\n</div>","created_utc":"2024-10-02 11:08:00","distinguished":null,"edited":"2024-10-02 11:15:58","id":"lq0gujz","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq063vf","score":3,"stickied":false,"replies":[{"author":"u/HSuke","body":"> All that said, what happens when there does exist something that cannot be printed?\n\nGresham's Law. It would become a decent investment but a terrible currency. Doing that for fiat would hurt the economy.\n\n> Also, what's this about people hoarding money\n\nLike in Japan between 1990-2010? Deflation occurs and the economy stalls. Stock prices go nowhere. Japan had mild low single-digit deflation. If they had severe double-digit deflation, it would be a very different story. In fact, they would probably need to use another currency just to keep the economy going","body_html":"<div class=\"md\"><blockquote>\n<p>All that said, what happens when there does exist something that cannot be printed?</p>\n</blockquote>\n\n<p>Gresham&#39;s Law. It would become a decent investment but a terrible currency. Doing that for fiat would hurt the economy.</p>\n\n<blockquote>\n<p>Also, what&#39;s this about people hoarding money</p>\n</blockquote>\n\n<p>Like in Japan between 1990-2010? Deflation occurs and the economy stalls. Stock prices go nowhere. Japan had mild low single-digit deflation. If they had severe double-digit deflation, it would be a very different story. In fact, they would probably need to use another currency just to keep the economy going</p>\n</div>","created_utc":"2024-10-02 13:18:35","distinguished":null,"edited":false,"id":"lq15fvw","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq0gujz","score":3,"stickied":false,"replies":[{"author":"u/aaj094","body":"What does it mean to 'keep the economy going'? People are always going to have to earn a living and therefore need to get out of bed and will consume what they like. Yes, they may reduce their discretionary spend. Why is this to be considered bad?","body_html":"<div class=\"md\"><p>What does it mean to &#39;keep the economy going&#39;? People are always going to have to earn a living and therefore need to get out of bed and will consume what they like. Yes, they may reduce their discretionary spend. Why is this to be considered bad?</p>\n</div>","created_utc":"2024-10-02 13:21:36","distinguished":null,"edited":false,"id":"lq160op","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq15fvw","score":2,"stickied":false,"replies":[{"author":"u/HSuke","body":"https://www.investopedia.com/terms/d/deflationary-spiral.asp\n\nOr see the section on Deflationary Spiral here: https://en.m.wikipedia.org/wiki/Deflation\n\nPretty much what happened during the Great Depression of the 1930s","body_html":"<div class=\"md\"><p><a href=\"https://www.investopedia.com/terms/d/deflationary-spiral.asp\">https://www.investopedia.com/terms/d/deflationary-spiral.asp</a></p>\n\n<p>Or see the section on Deflationary Spiral here: <a href=\"https://en.m.wikipedia.org/wiki/Deflation\">https://en.m.wikipedia.org/wiki/Deflation</a></p>\n\n<p>Pretty much what happened during the Great Depression of the 1930s</p>\n</div>","created_utc":"2024-10-02 13:46:34","distinguished":null,"edited":false,"id":"lq1au3f","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq160op","score":1,"stickied":false,"replies":[]}]}]}]},{"author":"u/DayTraderBiH","body":"Which is not a bad thing for example we have a deflation in the IT sector for the last  40 years and no one complains about PCs being too expensive.","body_html":"<div class=\"md\"><p>Which is not a bad thing for example we have a deflation in the IT sector for the last  40 years and no one complains about PCs being too expensive.</p>\n</div>","created_utc":"2024-10-02 10:23:19","distinguished":null,"edited":false,"id":"lq08dcm","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq063vf","score":3,"stickied":false,"replies":[{"author":"u/HSuke","body":"It's fine when a single sector experiences it. But if a whole economy experiences it, we get something like 1990s Japan where everyone spends less and hoards money.\n\nThen we have to care about Gresham's Law and declining money velocity, which hurts real GDP.","body_html":"<div class=\"md\"><p>It&#39;s fine when a single sector experiences it. But if a whole economy experiences it, we get something like 1990s Japan where everyone spends less and hoards money.</p>\n\n<p>Then we have to care about Gresham&#39;s Law and declining money velocity, which hurts real GDP.</p>\n</div>","created_utc":"2024-10-02 10:50:57","distinguished":null,"edited":false,"id":"lq0dmzk","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq08dcm","score":6,"stickied":false,"replies":[{"author":"u/asdafari12","body":"> we get something like 1990s Japan where everyone spends less and hoards money.\n\nWould a deflation of 1-2% change your investing decision away from stocks/real estate/crypto into money in a bank account? Is 2% inflation better than 2% deflation? I would say yes overall but I don't think we really know and whenever we talk about deflation, we give the extreme examples where deflation is so high that nobody wants to do anything but hold cash. 10+% inflation that we recently had is also very bad. I would rather have 2% deflation than 10% inflation.","body_html":"<div class=\"md\"><blockquote>\n<p>we get something like 1990s Japan where everyone spends less and hoards money.</p>\n</blockquote>\n\n<p>Would a deflation of 1-2% change your investing decision away from stocks/real estate/crypto into money in a bank account? Is 2% inflation better than 2% deflation? I would say yes overall but I don&#39;t think we really know and whenever we talk about deflation, we give the extreme examples where deflation is so high that nobody wants to do anything but hold cash. 10+% inflation that we recently had is also very bad. I would rather have 2% deflation than 10% inflation.</p>\n</div>","created_utc":"2024-10-02 12:28:21","distinguished":null,"edited":false,"id":"lq0vyqk","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq0dmzk","score":2,"stickied":false,"replies":[{"author":"u/HSuke","body":"> Would a deflation of 1-2% change your investing decision away from stocks/real estate/crypto into money in a bank account?\n\n1-2% is pretty mild, but it definitely happened even with that little deflation. Japanese bought up Japanese bonds and US bonds. Japan is literally the largest holder of US treasuries thanks to carry trade. Japanese stocks had 2 lost decades.","body_html":"<div class=\"md\"><blockquote>\n<p>Would a deflation of 1-2% change your investing decision away from stocks/real estate/crypto into money in a bank account?</p>\n</blockquote>\n\n<p>1-2% is pretty mild, but it definitely happened even with that little deflation. Japanese bought up Japanese bonds and US bonds. Japan is literally the largest holder of US treasuries thanks to carry trade. Japanese stocks had 2 lost decades.</p>\n</div>","created_utc":"2024-10-02 13:21:59","distinguished":null,"edited":"2024-10-02 13:26:16","id":"lq163dq","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq0vyqk","score":2,"stickied":false,"replies":[{"author":"u/asdafari12","body":"Is it only due to deflation or other factors too? They have an aging population and zero immigration. Also, China has exploded from the 90s and taken a lot of market share from Japan.","body_html":"<div class=\"md\"><p>Is it only due to deflation or other factors too? They have an aging population and zero immigration. Also, China has exploded from the 90s and taken a lot of market share from Japan.</p>\n</div>","created_utc":"2024-10-02 22:34:23","distinguished":null,"edited":false,"id":"lq3gikp","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq163dq","score":2,"stickied":false,"replies":[{"author":"u/HSuke","body":"Deflation wasn't the initial cause of the lost decades. It was started by an investment bubble that eventually lead to a mild deflationary spiral. And once Japan was in a deflationary spiral, it was very hard to get out of it, leading to decades long stagflation (decreased income, decreased economic output, decreased prices). Japanese companies stopped growing, researching, and investing. They cut staff.\n\nM2 money supply plunged 90% over 1991-1993. No one was spending, leading to price decrease. High savings rate and aging were already issues in Japan, and exacerbated in the problem of low money velocity.\n\nPeople held onto money because there were no good investments and because money could purchase more the longer they held onto it. Consumers kept expecting prices to drop. Companies felt that it was impossible to raise prices because no one would buy goods that increased in price.\n\nTechnically, overall inflation was around 1% during that period, but it was so low that it stunted economic growth.\n\nJapan initially set very low interest rates to try to get out of the recession, but that wasn't enough. It wasn't until AFTER Japan started increasing money supply using QE in 2013 along with negative interest rates in 2016 that the economy eventually bounced back.\n\nThere are so many good documentaries that cover this. e.g. https://www.youtube.com/watch?v=lmnVP35uZFY","body_html":"<div class=\"md\"><p>Deflation wasn&#39;t the initial cause of the lost decades. It was started by an investment bubble that eventually lead to a mild deflationary spiral. And once Japan was in a deflationary spiral, it was very hard to get out of it, leading to decades long stagflation (decreased income, decreased economic output, decreased prices). Japanese companies stopped growing, researching, and investing. They cut staff.</p>\n\n<p>M2 money supply plunged 90% over 1991-1993. No one was spending, leading to price decrease. High savings rate and aging were already issues in Japan, and exacerbated in the problem of low money velocity.</p>\n\n<p>People held onto money because there were no good investments and because money could purchase more the longer they held onto it. Consumers kept expecting prices to drop. Companies felt that it was impossible to raise prices because no one would buy goods that increased in price.</p>\n\n<p>Technically, overall inflation was around 1% during that period, but it was so low that it stunted economic growth.</p>\n\n<p>Japan initially set very low interest rates to try to get out of the recession, but that wasn&#39;t enough. It wasn&#39;t until AFTER Japan started increasing money supply using QE in 2013 along with negative interest rates in 2016 that the economy eventually bounced back.</p>\n\n<p>There are so many good documentaries that cover this. e.g. <a href=\"https://www.youtube.com/watch?v=lmnVP35uZFY\">https://www.youtube.com/watch?v=lmnVP35uZFY</a></p>\n</div>","created_utc":"2024-10-02 23:27:47","distinguished":null,"edited":false,"id":"lq3ljj7","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq3gikp","score":2,"stickied":false,"replies":[]}]}]}]}]}]}]},{"author":"u/fecalreceptacle","body":"0 eigen after depositing >4 eth into pendle's yt position well before end of season 1. just a tiny bit of worthless ethfi. i hate this fraud industry","body_html":"<div class=\"md\"><p>0 eigen after depositing &gt;4 eth into pendle&#39;s yt position well before end of season 1. just a tiny bit of worthless ethfi. i hate this fraud industry</p>\n</div>","created_utc":"2024-10-02 07:13:56","distinguished":null,"edited":false,"id":"lpz8xn7","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":11,"stickied":false,"replies":[{"author":"u/haurog","body":"Have you checked checkeigen.byzantine.fi to make sure your address cannot claim Eigen from one of the many projects. It helped me finding some small amounts in projects I was not aware I was even eligible for. The website does not need you to connect a wallet. Just paste in the address and it should give you a list of projects and what you are eligible.","body_html":"<div class=\"md\"><p>Have you checked checkeigen.byzantine.fi to make sure your address cannot claim Eigen from one of the many projects. It helped me finding some small amounts in projects I was not aware I was even eligible for. The website does not need you to connect a wallet. Just paste in the address and it should give you a list of projects and what you are eligible.</p>\n</div>","created_utc":"2024-10-02 07:59:45","distinguished":null,"edited":false,"id":"lpzh7mt","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpz8xn7","score":10,"stickied":false,"replies":[{"author":"u/alexiskef","body":"Just a note: for puffer, it returns the latest EXTRA tokens some users got, not the original (much bigger) number..","body_html":"<div class=\"md\"><p>Just a note: for puffer, it returns the latest EXTRA tokens some users got, not the original (much bigger) number..</p>\n</div>","created_utc":"2024-10-02 08:46:23","distinguished":null,"edited":false,"id":"lpzpucz","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpzh7mt","score":5,"stickied":false,"replies":[]},{"author":"u/Lazy_Physicist","body":"Now this is a fun website to check all this stuff! I was getting annoyed at having to keep track of all the potential platforms that I could have accrued eigen from... Thanks for showing this to me!","body_html":"<div class=\"md\"><p>Now this is a fun website to check all this stuff! I was getting annoyed at having to keep track of all the potential platforms that I could have accrued eigen from... Thanks for showing this to me!</p>\n</div>","created_utc":"2024-10-02 15:39:54","distinguished":null,"edited":false,"id":"lq1udw0","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpzh7mt","score":2,"stickied":false,"replies":[]},{"author":"u/fecalreceptacle","body":"I actually did try this when it was on vercel.app. Still shows 0 all the way down. Thank you though, haurog!","body_html":"<div class=\"md\"><p>I actually did try this when it was on vercel.app. Still shows 0 all the way down. Thank you though, haurog!</p>\n</div>","created_utc":"2024-10-02 10:18:20","distinguished":null,"edited":false,"id":"lq07f1w","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpzh7mt","score":3,"stickied":false,"replies":[{"author":"u/haurog","body":"I was afraid that would be the case. I was never too big in the YT game just a small amount in March. I got my small allocation in the first drop though.","body_html":"<div class=\"md\"><p>I was afraid that would be the case. I was never too big in the YT game just a small amount in March. I got my small allocation in the first drop though.</p>\n</div>","created_utc":"2024-10-02 11:14:38","distinguished":null,"edited":false,"id":"lq0i30s","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq07f1w","score":2,"stickied":false,"replies":[{"author":"u/fecalreceptacle","body":"Very interesting how this has all played out. Im quite disillusioned with points, and the future of airdrops in general","body_html":"<div class=\"md\"><p>Very interesting how this has all played out. Im quite disillusioned with points, and the future of airdrops in general</p>\n</div>","created_utc":"2024-10-02 11:20:38","distinguished":null,"edited":false,"id":"lq0j7m7","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq0i30s","score":3,"stickied":false,"replies":[{"author":"u/haurog","body":"To be honest I was surprised we got another round of airdrops. I was sure that they all died at the beginning of the bear market never to reappear again. We got another round. Much more toxic and extractive farming airdrops. With month long campaigns, seasons and rug pulls here and there. I am not really complaining, I am just exhausted.","body_html":"<div class=\"md\"><p>To be honest I was surprised we got another round of airdrops. I was sure that they all died at the beginning of the bear market never to reappear again. We got another round. Much more toxic and extractive farming airdrops. With month long campaigns, seasons and rug pulls here and there. I am not really complaining, I am just exhausted.</p>\n</div>","created_utc":"2024-10-02 13:07:12","distinguished":null,"edited":false,"id":"lq139q9","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq0j7m7","score":3,"stickied":false,"replies":[{"author":"u/fecalreceptacle","body":"Absolutely agreed. Though, I will admit that I've not payed nearly as much attention to the more recent airop.\n\nThe final 'points' game I've been playing is Orbiter. Lemme go check... Wait... Um?","body_html":"<div class=\"md\"><p>Absolutely agreed. Though, I will admit that I&#39;ve not payed nearly as much attention to the more recent airop.</p>\n\n<p>The final &#39;points&#39; game I&#39;ve been playing is Orbiter. Lemme go check... Wait... Um?</p>\n</div>","created_utc":"2024-10-02 13:39:29","distinguished":null,"edited":false,"id":"lq19gdj","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq139q9","score":3,"stickied":false,"replies":[]}]}]}]}]}]},{"author":"u/cryptomoon2020","body":"I am really shocked by the etherfi team. I got bad vibes from their CEO before, and now it seems they are nasty people.","body_html":"<div class=\"md\"><p>I am really shocked by the etherfi team. I got bad vibes from their CEO before, and now it seems they are nasty people.</p>\n</div>","created_utc":"2024-10-02 12:47:10","distinguished":null,"edited":false,"id":"lq0zhss","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpz8xn7","score":7,"stickied":false,"replies":[{"author":"u/fecalreceptacle","body":"Its quite a shame. I dont want the future of Ethereum(or crypto at all) to look like this...","body_html":"<div class=\"md\"><p>Its quite a shame. I dont want the future of Ethereum(or crypto at all) to look like this...</p>\n</div>","created_utc":"2024-10-02 13:33:22","distinguished":null,"edited":false,"id":"lq18a5o","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq0zhss","score":4,"stickied":false,"replies":[]}]},{"author":"u/DayTraderBiH","body":"You must have been using ether.fi?! They farmed all of us. Fuck ether.fi!","body_html":"<div class=\"md\"><p>You must have been using ether.fi?! They farmed all of us. Fuck ether.fi!</p>\n</div>","created_utc":"2024-10-02 10:25:03","distinguished":null,"edited":false,"id":"lq08p6b","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpz8xn7","score":6,"stickied":false,"replies":[{"author":"u/fecalreceptacle","body":"You are correct. Absolutely agreed. Not the first time Ive been rugged by seemingly 'legit' projects...\n\nThough Im completely out of the ecosystem, all my Synthetix spinoff airdrops from years ago were fair and profitable... not so much so with many more recent projects","body_html":"<div class=\"md\"><p>You are correct. Absolutely agreed. Not the first time Ive been rugged by seemingly &#39;legit&#39; projects...</p>\n\n<p>Though Im completely out of the ecosystem, all my Synthetix spinoff airdrops from years ago were fair and profitable... not so much so with many more recent projects</p>\n</div>","created_utc":"2024-10-02 10:31:07","distinguished":null,"edited":false,"id":"lq09vca","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq08p6b","score":4,"stickied":false,"replies":[]}]},{"author":"[deleted]","body":"Weird, I got a lot from just holding some swell and renzo restaked eth for a while. Dumped it all first chance I got.","body_html":"<div class=\"md\"><p>Weird, I got a lot from just holding some swell and renzo restaked eth for a while. Dumped it all first chance I got.</p>\n</div>","created_utc":"2024-10-02 07:22:37","distinguished":null,"edited":false,"id":"lpzag6f","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpz8xn7","score":2,"stickied":false,"replies":[{"author":"u/fecalreceptacle","body":"Last time i hunt for an airdrop or 'points'","body_html":"<div class=\"md\"><p>Last time i hunt for an airdrop or &#39;points&#39;</p>\n</div>","created_utc":"2024-10-02 07:29:17","distinguished":null,"edited":false,"id":"lpzbn4h","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpzag6f","score":1,"stickied":false,"replies":[]}]},{"author":"u/curious-b","body":"Season 1 eigen from etherfi (pre-March 15th iirc) was claimable directly from eigenlayer back in June. Did you miss it? You also should have got a lot of ETHFI in season 1 back in March.","body_html":"<div class=\"md\"><p>Season 1 eigen from etherfi (pre-March 15th iirc) was claimable directly from eigenlayer back in June. Did you miss it? You also should have got a lot of ETHFI in season 1 back in March.</p>\n</div>","created_utc":"2024-10-02 16:19:29","distinguished":null,"edited":false,"id":"lq206mb","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpz8xn7","score":1,"stickied":false,"replies":[{"author":"u/fecalreceptacle","body":"I just didnt get anything","body_html":"<div class=\"md\"><p>I just didnt get anything</p>\n</div>","created_utc":"2024-10-03 05:25:51","distinguished":null,"edited":false,"id":"lq4jx2w","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq206mb","score":1,"stickied":false,"replies":[]}]},{"author":"u/SplinterCole","body":"Well, deposited 3000usdc into YT on arb. Sold it back for 2700usdc and got 3000usdc worth of ETHFI tokens and 800usdc worth og EIGEN tokens. \nI love this «fraud industry»","body_html":"<div class=\"md\"><p>Well, deposited 3000usdc into YT on arb. Sold it back for 2700usdc and got 3000usdc worth of ETHFI tokens and 800usdc worth og EIGEN tokens. \nI love this «fraud industry»</p>\n</div>","created_utc":"2024-10-02 10:35:02","distinguished":null,"edited":false,"id":"lq0alyo","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpz8xn7","score":-1,"stickied":false,"replies":[{"author":"u/fecalreceptacle","body":"Good for you. I didnt. Ever consider that shit isnt even due to *gasp* FRAUD?\n\nedit: the fuck is the point of your comment? to try to invalidate my experience, or to rub your lucky experience in my face?","body_html":"<div class=\"md\"><p>Good for you. I didnt. Ever consider that shit isnt even due to <em>gasp</em> FRAUD?</p>\n\n<p>edit: the fuck is the point of your comment? to try to invalidate my experience, or to rub your lucky experience in my face?</p>\n</div>","created_utc":"2024-10-02 10:37:52","distinguished":null,"edited":"2024-10-02 10:41:34","id":"lq0b551","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq0alyo","score":-8,"stickied":false,"replies":[]}]}]},{"author":"u/kenzi28","body":"Did rabby wallet just nuked their wallet by disallowing custom gas settings?\n\nWhy did they do this??","body_html":"<div class=\"md\"><p>Did rabby wallet just nuked their wallet by disallowing custom gas settings?</p>\n\n<p>Why did they do this??</p>\n</div>","created_utc":"2024-10-02 17:17:53","distinguished":null,"edited":false,"id":"lq29dl4","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":2,"stickied":false,"replies":[{"author":"[deleted]","body":"[deleted]","body_html":"<div class=\"md\"><p>[deleted]</p>\n</div>","created_utc":"2024-10-02 17:20:55","distinguished":null,"edited":false,"id":"lq29uh6","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq29dl4","score":4,"stickied":false,"replies":[{"author":"u/kenzi28","body":"Looks like they changed the UI. Managed to find it now. Thank you sir!","body_html":"<div class=\"md\"><p>Looks like they changed the UI. Managed to find it now. Thank you sir!</p>\n</div>","created_utc":"2024-10-02 17:28:43","distinguished":null,"edited":false,"id":"lq2b29f","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq29uh6","score":4,"stickied":false,"replies":[]}]}]},{"author":"[deleted]","body":"[removed]","body_html":"<div class=\"md\"><p>[removed]</p>\n</div>","created_utc":"2024-10-02 09:13:15","distinguished":null,"edited":false,"id":"lpzv228","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t3_1fu8i74","score":-8,"stickied":false,"replies":[{"author":"u/somedaysitsdark","body":"[Welcome back!](https://i.imgur.com/YLQwgWm.png)","body_html":"<div class=\"md\"><p><a href=\"https://i.imgur.com/YLQwgWm.png\">Welcome back!</a></p>\n</div>","created_utc":"2024-10-02 09:34:39","distinguished":null,"edited":false,"id":"lpzz4v0","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpzv228","score":11,"stickied":false,"replies":[{"author":"u/Smart-Ocelot-5759","body":"Back into the cryptoverse I guess","body_html":"<div class=\"md\"><p>Back into the cryptoverse I guess</p>\n</div>","created_utc":"2024-10-02 10:29:12","distinguished":null,"edited":false,"id":"lq09hxt","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpzz4v0","score":2,"stickied":false,"replies":[{"author":"u/chris_dea","body":"What's another dump between friends...","body_html":"<div class=\"md\"><p>What&#39;s another dump between friends...</p>\n</div>","created_utc":"2024-10-02 10:43:52","distinguished":null,"edited":false,"id":"lq0ca9y","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lq09hxt","score":1,"stickied":false,"replies":[]}]}]},{"author":"u/communist_mini_pesto","body":"I dare you to post here on a green day ","body_html":"<div class=\"md\"><p>I dare you to post here on a green day </p>\n</div>","created_utc":"2024-10-02 10:18:02","distinguished":null,"edited":false,"id":"lq07d2v","is_submitter":false,"link_id":"t3_1fu8i74","parent_id":"t1_lpzv228","score":3,"stickied":false,"replies":[]}]}]}}}